[
  {
    "id": "T01.G7.01",
    "title": "Recognize and apply common algorithm patterns (search, sort, accumulate)",
    "short_name": "Identify algorithm patterns",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Students learn to recognize and name common algorithmic patterns: linear search (find first matching item), simple sort (reorder items), accumulation (collect sums or counts), and simulation (repeat action with updates). When given a problem, they choose the appropriate pattern.",
    "dependencies": [
      "T01.G6.01"
    ]
  },
  {
    "id": "T01.G7.02",
    "title": "Understand why different algorithms are chosen for different problems",
    "short_name": "Choose the right algorithm for the task",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Given a problem, students consider multiple possible algorithms and justify which is most appropriate based on efficiency, clarity, or fit. Example: Why use a specific sorting algorithm over repeated swaps? Why use binary search instead of linear? This develops algorithmic decision-making.",
    "dependencies": [
      "T01.G6.02",
      "T01.G7.01"
    ]
  },
  {
    "id": "T01.G7.03",
    "title": "Represent an algorithm in pseudocode or text code",
    "short_name": "Write pseudocode for an algorithm",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Students transition from block-based code to pseudocode or simple text-based code representation. They write an algorithm in plain language with code-like structure (e.g., \"for each item in list: if item > max, set max = item\"). This bridges to more formal programming.",
    "dependencies": [
      "T01.G7.02"
    ]
  },
  {
    "id": "T01.G7.04",
    "title": "Analyze an algorithm for correctness on edge cases",
    "short_name": "Test an algorithm on tricky inputs",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Students test an algorithm (given in code or pseudocode) on edge cases (empty input, single item, maximum/minimum values, repeats) and identify if it fails and why. This develops rigorous thinking about algorithm robustness.",
    "dependencies": [
      "T01.G7.02",
      "T04.G7.01"
    ]
  },
  {
    "id": "T01.G8.01",
    "title": "Design an algorithm for a simulation or model",
    "short_name": "Create an algorithm to simulate a process",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Students design an algorithm that simulates a real-world process or system (e.g., a predator-prey ecosystem, weather patterns with simple rules, or traffic flow). The algorithm repeatedly updates state and checks conditions to model behavior over time. This applies algorithmic thinking to simulation.",
    "dependencies": [
      "T01.G7.01"
    ]
  },
  {
    "id": "T01.G8.02",
    "title": "Understand recursion conceptually (algorithm calling itself)",
    "short_name": "Recognize recursive structure in problems",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Students encounter the concept that some problems can be solved by breaking them into smaller versions of themselves (recursion conceptually, not yet in code). Example: \"To find the largest number in a list, find the larger of the first number and the max of the rest.\" They understand the base case and recursive case but don't yet implement it in code (that's a high school topic).",
    "dependencies": [
      "T01.G7.03",
      "T01.G8.01"
    ]
  },
  {
    "id": "T01.G8.03",
    "title": "Analyze the impact of an algorithm on society or individuals",
    "short_name": "Evaluate real-world algorithm impacts",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Students examine a real-world algorithmic system (e.g., social media recommendation, search rankings, college admission scoring) and analyze its societal impacts. They consider who benefits, who might be harmed, ethical implications, and possible improvements.",
    "dependencies": [
      "T01.G8.02"
    ]
  },
  {
    "id": "T01.G8.04",
    "title": "Refactor a complex algorithm for clarity or efficiency",
    "short_name": "Simplify or optimize complex code",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Given a working but convoluted or inefficient algorithm (in block or text code), students refactor it to be clearer, more modular, or more efficient. Example: breaking a long script into named procedures, extracting repeated logic into a loop, or optimizing a search to avoid redundant checks.",
    "dependencies": [
      "T01.G8.02",
      "T03.G8.01"
    ]
  },
  {
    "id": "T02.G7.01",
    "title": "Trace an algorithm with state changes over time",
    "short_name": "Trace a simulation algorithm step by step",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students trace an algorithm that simulates a process or system over multiple timesteps (e.g., a ball rolling, a population growing, or a search process narrowing), tracking state changes and predicting behavior at future steps.",
    "dependencies": [
      "T02.G6.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G7.02",
    "title": "Design a flowchart for a sorting or search algorithm",
    "short_name": "Create a flowchart for finding or organizing data",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students create a flowchart for a simple algorithmic task such as linear search, bubble sort, or selection sort, using appropriate decision points and loops to represent the logic.",
    "dependencies": [
      "T02.G7.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G7.03",
    "title": "Analyze algorithm complexity and steps required",
    "short_name": "Count steps in algorithms and compare efficiency",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students analyze two algorithms that solve the same problem and count or estimate the number of steps (or time complexity in intuitive terms) each requires for different input sizes, reasoning about which is more efficient.",
    "dependencies": [
      "T02.G6.03",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G7.04",
    "title": "Trace an algorithm and identify a bug or edge case",
    "short_name": "Find where an algorithm fails",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students trace an algorithm (in pseudocode or code) with specific inputs, identify a case where it produces an incorrect result, and explain why (e.g., \"When the list is empty, it crashes\" or \"When the target is at the end, it takes too long\").",
    "dependencies": [
      "T02.G7.03",
      "T01.G7.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G7.06",
    "title": "Representation Tradeoffs: Detail vs. Simplicity",
    "short_name": "Evaluate representation tradeoffs",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students analyze and evaluate tradeoffs between different data representations: detailed vs. simple, accurate vs. usable, precise vs. understandable. They examine real examples (e.g., weather forecasts, nutritional labels, maps) and discuss: What information is emphasized? What is hidden or simplified? Who benefits from this representation? They learn that representation choices involve tradeoffs and reflect priorities.",
    "dependencies": [
      "T02.G6.06",
      "T27.G6.01"
    ]
  },
  {
    "id": "T02.G8.01",
    "title": "Write and test pseudocode for a non-trivial algorithm",
    "short_name": "Design and verify an algorithm with pseudocode",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students design pseudocode for a more complex algorithm (e.g., finding a median, checking if a number is prime, or simulating a simple game turn), then trace it with multiple test cases to verify correctness.",
    "dependencies": [
      "T02.G7.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G8.02",
    "title": "Create a flowchart for a decision-making process",
    "short_name": "Design a flowchart for a real-world decision",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students create a flowchart that models a real-world decision process (e.g., \"Should I play outside?\" with branches based on weather, temperature, and homework done, or \"How to choose a book\" based on genre and length preferences). This shows algorithm thinking applied to everyday reasoning.",
    "dependencies": [
      "T02.G8.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G8.03",
    "title": "Analyze and improve an algorithm's representation",
    "short_name": "Optimize how an algorithm is represented",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students are given an algorithm in one form (e.g., a verbose pseudocode) and are asked to improve its clarity or efficiency by refactoring its representation (e.g., shortening pseudocode, simplifying a flowchart, or adding comments to code).",
    "dependencies": [
      "T02.G7.03",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G8.04",
    "title": "Compare deterministic and probabilistic algorithms",
    "short_name": "Trace algorithms with and without randomness",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students trace two versions of an algorithm—one deterministic (same input always produces same output) and one probabilistic (uses randomness)—and articulate the differences, advantages, and disadvantages of each approach.",
    "dependencies": [
      "T02.G8.03",
      "T01.G8.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T02.G8.06",
    "title": "Feature Vectors for AI Classification",
    "short_name": "Create feature vectors for AI",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students create feature vectors to represent data for an AI classification task. For example, representing animals for classification: [has_fur: 1, number_of_legs: 4, can_fly: 0, habitat: 'land']. They understand that: (1) AI needs data in numerical/categorical format, (2) choosing the right features is crucial for AI performance, (3) some features are more informative than others, and (4) representation affects what the AI can learn. This bridges representation to machine learning.",
    "dependencies": [
      "T02.G7.06",
      "T25.G7.01",
      "T21.G7.01"
    ]
  },
  {
    "id": "T03.G7.01",
    "title": "Design a multi-stage simulation plan",
    "short_name": "Plan a step-by-step simulation",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students design a detailed plan for a simulation (e.g., ecosystem, physics, or social dynamics) that breaks it into components (agents, rules, interactions, data collection) and stages (setup, run, analyze). They learn systems thinking.",
    "dependencies": [
      "T03.G6.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T03.G7.02",
    "title": "Use XO to brainstorm and structure a game design document",
    "short_name": "Create a GDD with XO help",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students use XO to brainstorm and structure a formal Game Design Document (GDD) for a moderately complex game (mechanics, level progression, art style, story beats). They learn a professional planning format while leveraging AI.",
    "dependencies": [
      "T03.G7.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T03.G7.03",
    "title": "Decompose a data-driven app into models and views",
    "short_name": "Separate data and UI in a plan",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students plan an interactive data app (e.g., a leaderboard dashboard, quiz show, or survey tool) and explicitly separate the data model (what data is stored) from the UI (how it's displayed and interacted with). This teaches architectural decomposition.",
    "dependencies": [
      "T03.G7.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T03.G7.04",
    "title": "Identify and fix poor decomposition in a plan",
    "short_name": "Find and improve bad design choices",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students review a project plan that has poor decomposition (e.g., all code in one sprite, no separation between logic and UI, unclear dependencies) and suggest improvements to make it more modular and maintainable.",
    "dependencies": [
      "T03.G7.03",
      "T01.G7.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T03.G8.01",
    "title": "Plan a multi-feature interactive app with XO",
    "short_name": "Design a complex app with AI guidance",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students use XO to help plan a large project with multiple interconnected features (e.g., a learning app with lessons, quizzes, progress tracking, and a leaderboard). They create a detailed architecture plan showing data flow, feature modules, and dependencies.",
    "dependencies": [
      "T03.G7.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T03.G8.02",
    "title": "Create a formal project specification document",
    "short_name": "Write a professional project spec",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students create a formal specification document for a non-trivial project, including requirements, system architecture, component descriptions, data schemas, and testing strategy. This mimics industry-standard documentation.",
    "dependencies": [
      "T03.G8.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T03.G8.03",
    "title": "Analyze project complexity and estimate effort",
    "short_name": "Judge project scope and effort",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students read project plans of varying ambition and estimate the relative effort and risk (e.g., \"This plan requires 5 different sprites and complex collision—it's a 6-week project.\" vs \"This is simpler, maybe 2 weeks.\"). They learn to realistically assess scope.",
    "dependencies": [
      "T03.G8.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T03.G8.04",
    "title": "Refactor a large codebase into modules",
    "short_name": "Reorganize complex code into parts",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students take a moderately complex, working program (e.g., a game with 200+ blocks) and refactor it by extracting repeated logic into custom blocks, separating concerns across sprites, and adding documentation. This is a real-world refactoring task.",
    "dependencies": [
      "T03.G8.03",
      "T01.G8.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G7.01",
    "title": "Recognize iteration patterns in different contexts",
    "short_name": "Spot loop patterns in simulations and games",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students identify the iteration patterns underlying common game and simulation behaviors (e.g., \"update physics every frame,\" \"process each sprite,\" \"check all collisions\"), understanding that iteration is a fundamental building block.",
    "dependencies": [
      "T04.G6.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G7.02",
    "title": "Design composite algorithms using smaller algorithmic patterns",
    "short_name": "Build algorithms from smaller patterns",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students design a solution to a complex problem by recognizing that it can be decomposed into smaller, standard algorithmic patterns (e.g., a search pattern + an accumulator pattern) and combining them.",
    "dependencies": [
      "T04.G7.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G7.03",
    "title": "Optimize code by eliminating redundant patterns",
    "short_name": "Simplify code by removing repeated patterns",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students examine an existing project with redundant patterns and systematically refactor it, combining loops, nesting, and custom blocks to minimize duplication and improve clarity.",
    "dependencies": [
      "T04.G7.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G7.04",
    "title": "Explain how pattern recognition leads to better algorithm design",
    "short_name": "Justify pattern‑based design choices",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students articulate how recognizing patterns in a problem (or in existing solutions) leads to better algorithm design, including improved efficiency, readability, and generalizability.",
    "dependencies": [
      "T04.G7.03",
      "T03.G7.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G8.01",
    "title": "Recognize and leverage common algorithmic patterns",
    "short_name": "Use standard algorithm patterns in solutions",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students identify standard algorithmic patterns (e.g., linear search, accumulation, two‑pointer, divide‑and‑conquer) in problem descriptions and apply them effectively to solve problems, understanding that many problems can be solved by pattern matching to known solutions.",
    "dependencies": [
      "T04.G7.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G8.02",
    "title": "Design modular, reusable custom blocks for a project",
    "short_name": "Build a library of procedures for a project",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students design and build a suite of well‑named, well‑documented custom blocks (procedures) for a project, recognizing that good abstractions make code easier to reason about, test, and reuse across multiple scenes or game states.",
    "dependencies": [
      "T04.G8.01",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G8.03",
    "title": "Generalize a specific solution into a parameterized template",
    "short_name": "Turn a solution into a template others can reuse",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students take a working solution to a specific problem (e.g., a quiz with five questions) and generalize it into a reusable template with parameters (e.g., `make_quiz(num_questions, question_list)`) that others can adapt for different inputs, learning that good design anticipates reuse.",
    "dependencies": [
      "T04.G8.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T04.G8.04",
    "title": "Analyze and justify choices in pattern‑based design",
    "short_name": "Explain trade‑offs in abstraction and reuse",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students examine a project and argue about design choices (e.g., \"Should this be a custom block or inline code?\" \"Is this parameter necessary?\"). They weigh factors like code length, clarity, flexibility, and performance in the context of the problem.",
    "dependencies": [
      "T04.G8.03",
      "T03.G8.02",
      "T01.G2.01"
    ]
  },
  {
    "id": "T05.G7.01",
    "title": "Accessibility audit and remediation",
    "short_name": "Audit a program for accessibility",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students audit an existing program (CreatiCode project or a web app) against an accessibility checklist (readable text, keyboard navigation, color contrast, alt text for images, clear instructions). They identify gaps and propose or implement fixes.",
    "dependencies": [
      "T05.G6.01"
    ]
  },
  {
    "id": "T05.G7.02",
    "title": "Identify and mitigate potential harms in a design",
    "short_name": "What could go wrong? Prevent harms.",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students brainstorm potential negative impacts or unintended consequences of a program they've designed (e.g., \"My game is addictive and kids might play too long,\" \"My chatbot gives wrong answers\"). They identify one harm and propose a mitigation strategy (e.g., add a play-time limit, add a disclaimer, verify sources).",
    "dependencies": [
      "T05.G7.01"
    ]
  },
  {
    "id": "T05.G7.03",
    "title": "Gather iterative feedback across multiple rounds",
    "short_name": "Multi-round user testing and refinement",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students conduct 2–3 rounds of user testing on a program they're developing. After each round, they analyze feedback, make changes, and test again. They document how the program evolves and reflect on insights gained.",
    "dependencies": [
      "T05.G6.03"
    ]
  },
  {
    "id": "T05.G7.04",
    "title": "Design a simulation for a real-world question",
    "short_name": "Simulation to answer a research question",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students design and build a simulation to answer a real-world or classroom question (e.g., \"How does population grow if there's limited food?\" or \"What happens to a virus spreading in a population?\"). They define what to model, run the simulation, and interpret results.",
    "dependencies": [
      "T05.G7.03",
      "T03.G7.02"
    ]
  },
  {
    "id": "T05.G8.01",
    "title": "Analyze potential biases in an algorithm or design",
    "short_name": "Find and fix biases in your design",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students examine an algorithm or program they've designed and identify potential biases (e.g., does it work equally well for all genders, abilities, or backgrounds?). They propose and implement changes to mitigate bias (e.g., diverse imagery, inclusive language, accessible features).",
    "dependencies": [
      "T05.G7.01"
    ]
  },
  {
    "id": "T05.G8.02",
    "title": "Design for diverse audiences with conflicting needs",
    "short_name": "Serve multiple user groups with different needs",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students design a program or algorithm that must satisfy two or more distinct user groups with potentially conflicting needs (e.g., \"A math game for 2nd graders AND their parents,\" \"A website for English learners AND native speakers\"). They document trade-offs and design decisions that balance needs.",
    "dependencies": [
      "T05.G8.01"
    ]
  },
  {
    "id": "T05.G8.03",
    "title": "Run a controlled simulation experiment",
    "short_name": "Experiment with a simulation model",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students build a simulation, then systematically vary one parameter at a time (e.g., starting population, food availability) and observe effects on outcomes. They document hypotheses, results, and conclusions. This teaches simulation as a tool for experimentation and evidence-based reasoning.",
    "dependencies": [
      "T05.G7.03"
    ]
  },
  {
    "id": "T05.G8.04",
    "title": "Evaluate realism and limitations in a simulation",
    "short_name": "How realistic is your simulation?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students critically examine a simulation they've built or studied and evaluate its realism and limitations. They identify simplifications, assumptions, and edge cases not covered. They articulate how limitations might affect conclusions drawn from the simulation.",
    "dependencies": [
      "T05.G8.03",
      "T03.G8.02"
    ]
  },
  {
    "id": "T06.G7.01",
    "title": "Design state machines using events",
    "short_name": "Use events to manage game states",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 7,
    "description": "Students model a program using state machines where each state (menu, playing, paused, game-over) is a distinct set of event handlers, and broadcasts or events trigger transitions between states.",
    "dependencies": [
      "T06.G6.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T06.G7.02",
    "title": "Use event broadcasting for loose coupling",
    "short_name": "Decouple systems with broadcasts",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 7,
    "description": "Students design large programs (e.g., games with multiple enemies, items, UI) where components communicate only through broadcasts rather than direct references, reducing complexity and improving modularity.",
    "dependencies": [
      "T06.G6.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T06.G7.03",
    "title": "Trace and optimize event handling order",
    "short_name": "Analyze event priorities and timing",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 7,
    "description": "Students examine event-driven code and reason about which scripts should run first, how timing affects behavior, and whether the order of broadcasts and receivers could be improved for correctness or performance.",
    "dependencies": [
      "T06.G6.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T06.G7.04",
    "title": "Implement complex event sequences in projects",
    "short_name": "Multi-stage event sequences",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 7,
    "description": "Students build projects where events follow complex, conditional sequences: initial triggers lead to broadcasts, which themselves broadcast further events, and the final outcomes depend on program state.",
    "dependencies": [
      "T06.G6.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T06.G8.01",
    "title": "Design responsive multiplayer event handling",
    "short_name": "Coordinate events across players",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 8,
    "description": "Students program a multiplayer or networked scenario where events from multiple players (e.g., broadcasts or input streams) must be received and processed correctly, handling race conditions and ensuring fair, synchronized behavior.",
    "dependencies": [
      "T06.G7.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T06.G8.02",
    "title": "Implement custom event listeners and handlers",
    "short_name": "Create reusable event-handling patterns",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 8,
    "description": "Students design custom blocks or scripts that encapsulate event-handling logic (e.g., a reusable \"on-click-handler\" or \"collision-detector\") so that events can be managed consistently across multiple objects.",
    "dependencies": [
      "T06.G7.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T06.G8.03",
    "title": "Analyze and optimize event-driven architecture",
    "short_name": "Evaluate event system design",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 8,
    "description": "Students review an existing event-driven program (e.g., a complex game), identify inefficiencies or coupling issues, and propose or implement improvements to the event architecture.",
    "dependencies": [
      "T06.G7.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T06.G8.04",
    "title": "Justify event-handling choices for different scenarios",
    "short_name": "Explain event design decisions",
    "topic_id": "T06",
    "topic_name": "Events & Sequencing in Programs",
    "grade": 8,
    "description": "Students compare different event architectures (e.g., polling vs. broadcast-based, green flag + key events vs. a game loop) and explain when each is appropriate and why, considering clarity, efficiency, and maintainability.",
    "dependencies": [
      "T06.G7.01",
      "T01.G1.01"
    ]
  },
  {
    "id": "T07.G7.01",
    "title": "Use loops to simulate motion over time",
    "short_name": "Loop for step‑by‑step simulation",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 7,
    "description": "Students implement a loop that repeatedly updates position (and optionally velocity) to simulate motion, such as an object sliding or falling with a simple rule each step.",
    "dependencies": [
      "T07.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T07.G7.02",
    "title": "Nested loops for 2D grids and tile maps",
    "short_name": "Nested loops for grid processing",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 7,
    "description": "Students use two loops to process a conceptual 2D grid (e.g., rows and columns of tiles), even if represented as positions or a 1D list plus indices, introducing matrix‑like reasoning.",
    "dependencies": [
      "T07.G6.01",
      "T07.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T07.G7.03",
    "title": "Compare loop algorithms by counting steps",
    "short_name": "Compare two loop solutions",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 7,
    "description": "Students compare two loop‑based solutions that both solve the same problem but use different numbers of iterations (e.g., repeated subtraction vs direct arithmetic) and reason about which is more efficient for larger inputs.",
    "dependencies": [
      "T07.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T07.G7.04",
    "title": "Loop patterns for counting and accumulation",
    "short_name": "Recognize loop accumulator patterns",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 7,
    "description": "Students identify and/or construct loops that follow common accumulator patterns (counting, summing, tracking min/max), distinguishing them from unrelated code.",
    "dependencies": [
      "T07.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T07.G8.01",
    "title": "Monte Carlo simulations with loops",
    "short_name": "Estimate probabilities using loops",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 8,
    "description": "Students design loop‑based simulations that approximate probabilities (e.g., estimate chance of rolling a sum ≥ 9 with two dice) and interpret the results in terms of experimental vs theoretical probability.",
    "dependencies": [
      "T07.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T07.G8.02",
    "title": "Implement iterative algorithms with loops",
    "short_name": "Implement iterative algorithms (e.g., GCD)",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 8,
    "description": "Students implement simple iterative algorithms that rely on loops and repeated updates, such as computing the greatest common divisor by repeated subtraction or checking if a number is prime by trying divisors.",
    "dependencies": [
      "T07.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T07.G8.03",
    "title": "Process structured data with nested loops",
    "short_name": "Nested loops over 2D data",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 8,
    "description": "Students use nested loops to process 2D‑structured data (e.g., a list encoding grid values, or two parallel lists) and compute statistics like row/column sums or counts of certain cells.",
    "dependencies": [
      "T07.G7.01",
      "T07.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T07.G8.04",
    "title": "Analyze and justify loop designs",
    "short_name": "Explain loop choices for a task",
    "topic_id": "T07",
    "topic_name": "Loops & Repetition",
    "grade": 8,
    "description": "Students analyze given loop‑based solutions (e.g., using `repeat until` vs a counted `repeat` with a condition inside) and justify which structure is more appropriate or reliable for a given task. They articulate reasons using input ranges, stopping conditions, and readability.",
    "dependencies": [
      "T07.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T08.G7.01",
    "title": "Use conditionals to implement a state machine",
    "short_name": "Conditionals for state transitions",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 7,
    "description": "Students use if/else blocks to track and transition between program states (e.g., menu → playing → game over → restart). They understand how conditionals drive state changes.",
    "dependencies": [
      "T08.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T08.G7.02",
    "title": "Handle edge cases and boundary conditions",
    "short_name": "Test and handle boundary cases",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 7,
    "description": "Students write conditionals that handle boundary and edge cases (e.g., \"if score == 0\", \"if x < 0 or x > screen_width\"), preventing bugs or unexpected behavior.",
    "dependencies": [
      "T08.G6.01",
      "T08.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T08.G7.03",
    "title": "Write conditionals for pattern recognition or rule-checking",
    "short_name": "Conditionals for pattern matching",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 7,
    "description": "Students use if statements to detect patterns or check membership (e.g., \"if this word is in my list of banned words\", \"if the sequence is ascending\"). This applies conditionals to data validation and pattern detection.",
    "dependencies": [
      "T08.G6.01",
      "T08.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T08.G7.04",
    "title": "Analyze and compare conditional logic approaches",
    "short_name": "Compare conditional implementations",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 7,
    "description": "Students compare two different conditional implementations of the same algorithm (e.g., using nested if vs a switch-like structure) and reason about clarity, efficiency, and maintainability.",
    "dependencies": [
      "T08.G6.01",
      "T08.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T08.G8.01",
    "title": "Implement multi-stage game or simulation logic",
    "short_name": "Complex game state and rules",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 8,
    "description": "Students design conditional logic for a multi-stage game or simulation (e.g., tutorial → levels 1-3 → boss battle → game over, each with different rule sets). They manage transitions and state-specific behavior.",
    "dependencies": [
      "T08.G7.01",
      "T08.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T08.G8.02",
    "title": "Use conditionals to validate and sanitize input data",
    "short_name": "Input validation with conditionals",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 8,
    "description": "Students write if statements that validate user input (e.g., \"if the input is not a number, show error message\"; \"if the age is < 0 or > 150, reject and ask again\"). This applies conditional logic to data integrity.",
    "dependencies": [
      "T08.G7.01",
      "T08.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T08.G8.03",
    "title": "Process and make decisions on structured data with nested conditionals",
    "short_name": "Conditional decision trees for data",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 8,
    "description": "Students use nested or chained conditionals to traverse a decision tree or make hierarchical decisions on data (e.g., categorizing users by age and spending, or classifying items by multiple attributes).",
    "dependencies": [
      "T08.G7.01",
      "T08.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T08.G8.04",
    "title": "Analyze and document the logic of conditional algorithms",
    "short_name": "Document and explain conditional logic",
    "topic_id": "T08",
    "topic_name": "Conditionals & Logic",
    "grade": 8,
    "description": "Students analyze a conditional algorithm, document its decision logic (often via a flowchart or comment), and justify why specific conditions are needed.",
    "dependencies": [
      "T08.G7.01",
      "T08.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T09.G7.01",
    "title": "Use variables to store and update state in simulations",
    "short_name": "Variables in simulations",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 7,
    "description": "Students create simulations (e.g., population, weather, particle motion) where variables represent state (position, velocity, count) and expressions update them each time step, demonstrating how variables enable temporal processes.",
    "dependencies": [
      "T09.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G7.02",
    "title": "Use aggregate expressions (sum, average, min, max)",
    "short_name": "Calculate aggregate statistics",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 7,
    "description": "Students write expressions or use blocks to compute aggregate statistics (sum, average, minimum, maximum) over variables or lists, connecting expressions to data analysis.",
    "dependencies": [
      "T09.G6.01",
      "T09.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G7.03",
    "title": "Use variables in conditional logic with compound conditions",
    "short_name": "Use AND/OR in complex conditions",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 7,
    "description": "Students create conditional expressions using logical operators (AND, OR, NOT) to combine multiple variable comparisons, enabling more nuanced decision logic.",
    "dependencies": [
      "T09.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G7.04",
    "title": "Analyze how variable updates affect program behavior",
    "short_name": "Understand variable impact on behavior",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 7,
    "description": "Students reason about how changing variable initialization values, update rates, or expressions changes the program's output or behavior, supporting algorithmic analysis.",
    "dependencies": [
      "T09.G6.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G8.01",
    "title": "Use variables in iterative algorithms",
    "short_name": "Variables in complex algorithms",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 8,
    "description": "Students implement algorithms (e.g., searching, sorting, iterative numerical methods) that rely on variables to track state across many iterations, such as a variable tracking the index in a search or the accumulator in a repeated approximation.",
    "dependencies": [
      "T09.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G8.02",
    "title": "Analyze expressions for efficiency and correctness",
    "short_name": "Evaluate expression design",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 8,
    "description": "Students compare different expressions or variable strategies that solve the same problem (e.g., computing a sum by repeated addition vs direct formula) and reason about correctness, readability, and efficiency.",
    "dependencies": [
      "T09.G7.01",
      "T09.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G8.03",
    "title": "Use variables in data collection and statistical analysis",
    "short_name": "Variables for data-driven programs",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 8,
    "description": "Students use variables (or lists of variables) to collect data from user input or sensors, compute statistics on the data, and use those statistics in expressions to make decisions or report findings.",
    "dependencies": [
      "T09.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G8.04",
    "title": "Debug variable-related logical errors",
    "short_name": "Fix complex variable bugs",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 8,
    "description": "Students identify and fix bugs related to variable scope, initialization order, incorrect update expressions, or misuse of variables in conditionals. Debugging is more sophisticated, involving tracing across multiple blocks or loops.",
    "dependencies": [
      "T09.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T09.G8.05",
    "title": "Use expressions to implement mathematical or logical rules",
    "short_name": "Implement formulas in code",
    "topic_id": "T09",
    "topic_name": "Variables & Expressions",
    "grade": 8,
    "description": "Students take mathematical formulas or logical rules (e.g., distance = speed × time, tax = price × rate, is_valid = age >= 18 AND has_id) and translate them into variable assignments and expressions in code.",
    "dependencies": [
      "T09.G7.01",
      "T09.G7.01",
      "T01.G1.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T10.G7.01",
    "title": "Design and populate a table for a real-world inventory or database",
    "short_name": "Create a data model for real-world data",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 7,
    "description": "Students design the structure of a table (columns and data types) to model a real-world domain (e.g., a library catalog, game inventory, sports statistics) and populate it with realistic data.",
    "dependencies": [
      "T10.G6.01",
      "T10.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G7.02",
    "title": "Analyze a dataset to find patterns or outliers",
    "short_name": "Investigate table data for insights",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 7,
    "description": "Students examine a table of data and use code to find patterns (e.g., the most common value, a trend over time) or identify outliers (unusual values). They may create summary statistics or visualizations.",
    "dependencies": [
      "T10.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G7.03",
    "title": "Transform or clean data in a table using loops and conditions",
    "short_name": "Clean and preprocess table data",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 7,
    "description": "Students perform data cleaning operations: remove rows with missing values, standardize formats (e.g., uppercase names), fix errors, or handle special cases—preparing raw data for analysis.",
    "dependencies": [
      "T10.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G7.04",
    "title": "Use nested loops to analyze relationships between two datasets",
    "short_name": "Compare data from multiple tables",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 7,
    "description": "Students write nested loops to compare or correlate data from two tables (e.g., matching purchases to customer profiles, checking for correlations in sensor readings), identifying connections or anomalies.",
    "dependencies": [
      "T10.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G8.01",
    "title": "Implement a data structure using lists (simple version of array of records)",
    "short_name": "Build a data structure with lists",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 8,
    "description": "Students implement a simple record or struct-like behavior using multiple parallel lists or a list of lists, simulating how professional code organizes complex data.",
    "dependencies": [
      "T10.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G8.02",
    "title": "Implement a sorting algorithm (bubble sort or selection sort)",
    "short_name": "Write a sorting algorithm",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 8,
    "description": "Students implement a complete sorting algorithm (not just swap intuition, but the full loop logic) to sort a list or table by a numeric or alphabetic criterion, understanding algorithmic complexity informally (e.g., \"this takes many comparisons\").",
    "dependencies": [
      "T10.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G8.03",
    "title": "Build a simulation using list-based state",
    "short_name": "Simulate a system with list data",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 8,
    "description": "Students create a simulation (e.g., a game, a population model, a traffic system) where entities and their properties are stored in lists or tables, and the simulation loop reads/updates this data each frame.",
    "dependencies": [
      "T10.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G8.04",
    "title": "Query and report statistics from a complex dataset",
    "short_name": "Analyze a real dataset with code",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 8,
    "description": "Students load or are provided a realistic multi-column table (e.g., weather data, sports statistics, survey results) and write code to compute requested statistics: means, medians, percentiles, counts by category, trends, or comparisons.",
    "dependencies": [
      "T10.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T10.G8.05",
    "title": "Model real-world relationships using table joins or lookups",
    "short_name": "Manage related data in a program",
    "topic_id": "T10",
    "topic_name": "Lists, Tables & Structured Data in Programs",
    "grade": 8,
    "description": "Students use lists or tables to model entities and relationships (e.g., students with associated grades, orders with associated items), and write code to perform lookups or join operations to answer queries (e.g., \"What grades does student X have?\").",
    "dependencies": [
      "T10.G7.01",
      "T10.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T11.G7.01",
    "title": "Use custom blocks to implement algorithms",
    "short_name": "Code an algorithm as a custom block",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 7,
    "description": "Students implement standard or simple algorithms (e.g., linear search, bubble sort, greatest common divisor) as custom blocks with clear parameters and return values, demonstrating that a complex algorithm can be encapsulated in a reusable block.",
    "dependencies": [
      "T11.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T11.G7.02",
    "title": "Design a set of related blocks for a subsystem",
    "short_name": "Create a family of related blocks",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 7,
    "description": "Students design a cohesive set of custom blocks that work together to implement a feature or subsystem, such as a \"Sprite Physics\" system with blocks for velocity, acceleration, and collision, or a \"Dialogue System\" with blocks for NPC interaction.",
    "dependencies": [
      "T11.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T11.G7.03",
    "title": "Understand encapsulation and data hiding",
    "short_name": "Hide implementation details in blocks",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 7,
    "description": "Students learn that a well-designed custom block hides its implementation details from the user; the caller only needs to know the interface (parameters and return value), not how it works inside. This is a step toward object-oriented thinking.",
    "dependencies": [
      "T11.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T11.G7.04",
    "title": "Trace and debug complex block hierarchies",
    "short_name": "Follow execution through nested blocks",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 7,
    "description": "Students trace through the execution of a script that calls blocks, which in turn call other blocks, predicting outputs and identifying bugs. This reinforces call stack thinking.",
    "dependencies": [
      "T11.G6.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T11.G8.01",
    "title": "Design blocks for a game or simulation framework",
    "short_name": "Build reusable game components",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 8,
    "description": "Students design a small library of custom blocks that could be reused across multiple games or projects, such as \"CheckCollision [sprite1] [sprite2]\", \"DrawHUD [score] [lives]\", and \"HandleGameState [state]\". They demonstrate reusability by using the same blocks in two different game projects.",
    "dependencies": [
      "T11.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T11.G8.02",
    "title": "Refactor a complex program into a well-organized block hierarchy",
    "short_name": "Restructure a large program with blocks",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 8,
    "description": "Students take a large, unorganized program (30+ blocks) and reorganize it using a thoughtful hierarchy of custom blocks—top-level blocks that call mid-level blocks, which call low-level utility blocks—improving clarity and maintainability.",
    "dependencies": [
      "T11.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T11.G8.03",
    "title": "Use custom blocks with complex data (lists, objects)",
    "short_name": "Write blocks that handle complex data types",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 8,
    "description": "Students create custom blocks that accept and return complex data structures (lists of sprites, lists of objects with multiple attributes), enabling powerful abstractions for managing game entities, inventories, or other game data.",
    "dependencies": [
      "T11.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T11.G8.04",
    "title": "Analyze trade-offs in modular vs. monolithic design",
    "short_name": "Compare modular and inline code",
    "topic_id": "T11",
    "topic_name": "Functions & Modularization",
    "grade": 8,
    "description": "Students examine two versions of a program: one organized into many custom blocks, one written mostly inline. They discuss trade-offs in readability, maintainability, performance, and complexity, developing critical thinking about when and how much to modularize.",
    "dependencies": [
      "T11.G7.01",
      "T01.G1.01",
      "T09.G3.01",
      "T06.G3.01"
    ]
  },
  {
    "id": "T12.G7.01",
    "title": "Refactor long scripts into smaller, named subroutines",
    "short_name": "Break a long script into smaller blocks",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 7,
    "description": "Students identify a script with many statements and refactor it by extracting logical groups into separate custom blocks, each with a clear name. This reduces script complexity and improves readability.",
    "dependencies": [
      "T12.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T12.G7.02",
    "title": "Analyze readability vs performance trade-offs",
    "short_name": "Compare readability and efficiency",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 7,
    "description": "Students examine two solutions to the same problem—one more readable but longer, and one more compact but harder to understand—and discuss the trade-off, learning when to prioritize clarity.",
    "dependencies": [
      "T12.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T12.G7.03",
    "title": "Create a code review checklist for clarity",
    "short_name": "Make a checklist for code review",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 7,
    "description": "Students create a checklist of items to look for when reviewing code for clarity and organization (e.g., \"Are all variables named clearly?\" \"Are comments present for complex blocks?\" \"Is code grouped logically?\") and use it to evaluate a peer's or sample project.",
    "dependencies": [
      "T12.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T12.G7.04",
    "title": "Document design decisions in code",
    "short_name": "Explain why you designed it this way",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 7,
    "description": "Students add \"design comments\" to their code explaining major architectural choices (e.g., \"I use a table to store enemy positions so it's easy to add new enemies\" or \"I use a state variable instead of multiple forever loops to avoid conflicts\").",
    "dependencies": [
      "T12.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T12.G8.01",
    "title": "Apply consistent style across a large project",
    "short_name": "Keep style consistent everywhere",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 8,
    "description": "Students work on a larger project (5+ scripts, many variables) and ensure consistent naming conventions, comment styles, script organization, and indentation throughout, demonstrating professional code hygiene.",
    "dependencies": [
      "T12.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T12.G8.02",
    "title": "Create comprehensive documentation for a complex project",
    "short_name": "Write full documentation",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 8,
    "description": "Students create a formal documentation guide for a multi-feature project, including: overview, user instructions, code architecture (script purposes and interactions), variable reference, and custom block specifications.",
    "dependencies": [
      "T12.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T12.G8.03",
    "title": "Refactor for maintainability in a team context",
    "short_name": "Refactor so a team can work on it",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 8,
    "description": "Students refactor a project to be modular and well-documented so that team members can work on different features independently, with clear boundaries (separate scripts, well-named custom blocks, commented responsibilities).",
    "dependencies": [
      "T12.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T12.G8.04",
    "title": "Evaluate and improve code for accessibility and inclusion",
    "short_name": "Make code clear for diverse learners",
    "topic_id": "T12",
    "topic_name": "Program Organization, Style & Readability",
    "grade": 8,
    "description": "Students examine their code and documentation with an eye toward accessibility and clarity for diverse learners: simple language, explanations of non-obvious choices, alternatives documented, no jargon assumed known.",
    "dependencies": [
      "T12.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T09.G3.01",
      "T11.G3.01"
    ]
  },
  {
    "id": "T13.G7.01",
    "title": "Write comprehensive test cases for an algorithm",
    "short_name": "Create tests for all algorithm cases",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 7,
    "description": "Students analyze an algorithm (e.g., finding the maximum in a list, checking if a number is prime) and write a thorough test suite covering normal cases, edge cases (e.g., empty list, single item, boundary values), and invalid inputs. They run all tests and record coverage.",
    "dependencies": [
      "T13.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T13.G7.02",
    "title": "Debug logic errors in complex programs",
    "short_name": "Find and fix logic bugs",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 7,
    "description": "Students identify and correct logic errors in a program (bugs that don't crash the program but produce wrong results, such as off-by-one errors, incorrect operators, or wrong variable assignments). These are harder to spot than syntax errors.",
    "dependencies": [
      "T13.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T13.G7.03",
    "title": "Refactor for testability and clarity",
    "short_name": "Improve code so it's easier to test and debug",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 7,
    "description": "Students refactor a program to reduce complexity, improve clarity, and make testing easier (e.g., breaking large scripts into smaller functions, naming variables clearly, removing duplicated code). They then verify the refactored version still works.",
    "dependencies": [
      "T13.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T13.G7.04",
    "title": "Compare reliability of different program designs",
    "short_name": "Analyze programs for robustness",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 7,
    "description": "Students examine two or more designs for the same task, evaluate their handling of edge cases and error conditions, and argue which is more reliable and why.",
    "dependencies": [
      "T13.G6.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T13.G8.01",
    "title": "Design and execute a rigorous test suite",
    "short_name": "Create comprehensive test cases with coverage reporting",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 8,
    "description": "Students design a test suite that explicitly covers all code paths and critical scenarios, run the tests systematically, and document coverage (e.g., how many branches were tested, how many edge cases). They track which tests pass and fail.",
    "dependencies": [
      "T13.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T13.G8.02",
    "title": "Debug for correctness against specifications",
    "short_name": "Verify program matches its specification",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 8,
    "description": "Given a formal (or semi-formal) specification of a program's expected behavior, students test the implementation against it, identify discrepancies, and fix bugs until the program matches the specification.",
    "dependencies": [
      "T13.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T13.G8.03",
    "title": "Handle errors gracefully with try-and-catch patterns",
    "short_name": "Use error handling blocks",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 8,
    "description": "Students add error-handling logic (e.g., checking for valid input, handling cases where operations might fail) to make a program robust. They prevent crashes and ensure graceful degradation or user-friendly error messages.",
    "dependencies": [
      "T13.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T13.G8.04",
    "title": "Reflect on accuracy, bias, and quality of generated code",
    "short_name": "Evaluate code for correctness and bias",
    "topic_id": "T13",
    "topic_name": "Testing, Debugging & Error Handling",
    "grade": 8,
    "description": "Students review code (either their own or AI-generated) and consider questions like: Does it correctly solve the stated problem? Are there edge cases it misses? Could it introduce bias or unintended harm? What assumptions does it make? This critical analysis develops higher-order thinking about code quality.",
    "dependencies": [
      "T13.G7.01",
      "T01.G1.01",
      "T06.G3.01",
      "T08.G3.01",
      "T09.G3.01"
    ]
  },
  {
    "id": "T14.G7.01",
    "title": "Simulate physics: gravity and jumping",
    "short_name": "Add gravity and jumping to platformer",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 7,
    "description": "Students implement a simple physics system: a character has velocity in the y‑direction, gravity continuously increases downward velocity, and jumping (pressing a key) sets upward velocity if the character is on the ground. This introduces continuous numerical simulation.",
    "dependencies": [
      "T14.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T14.G7.02",
    "title": "Implement simple pathfinding (waypoints or A*)",
    "short_name": "Make an enemy navigate intelligently",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 7,
    "description": "Students implement a pathfinding system where enemies move toward a goal or follow a predetermined path. Simple variants use waypoints; more advanced variants approximate A‑star behavior by moving toward the player while avoiding obstacles.",
    "dependencies": [
      "T14.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T14.G7.03",
    "title": "Optimize collision checking to avoid lag",
    "short_name": "Make collision detection efficient",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 7,
    "description": "When a game has many objects, checking all pairs can lag. Students learn to optimize: only check collisions for nearby objects (using quadtrees or spatial hashing concepts), cache results, or reduce check frequency. Even a conceptual understanding of the problem builds algorithmic thinking.",
    "dependencies": [
      "T14.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T14.G7.04",
    "title": "Analyze and balance game difficulty",
    "short_name": "Tune game difficulty parameters",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 7,
    "description": "Students play and analyze their game, identifying difficulty parameters (enemy speed, health, respawn rate, reward amounts), and deliberately adjust them to achieve a specific difficulty curve. They might gather data on success rates or time to completion and use it to guide balance.",
    "dependencies": [
      "T14.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T14.G8.01",
    "title": "Architect a game using modular custom blocks",
    "short_name": "Design game code with reusable functions",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 8,
    "description": "Students deliberately design their game architecture using custom blocks (procedures/functions) to encapsulate game systems: collision handler, spawn system, update physics, render, etc. This introduces software engineering principles.",
    "dependencies": [
      "T14.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T14.G8.02",
    "title": "Implement a particle system (visual effects)",
    "short_name": "Create visual feedback with particles",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 8,
    "description": "Students implement a simple particle system: many small visual elements (e.g., sparks, smoke) that emit, move, fade, and disappear, creating visual feedback for events (explosions, hits). This combines loops, timing, and array/list management.",
    "dependencies": [
      "T14.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T14.G8.03",
    "title": "Design game levels using data structures",
    "short_name": "Create levels from tile maps or data",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 8,
    "description": "Instead of manually placing each game object, students define levels using data structures (lists of lists, or a string representing a tile map) and a parser that converts the data into actual game objects. This teaches data‑driven design and scales level creation.",
    "dependencies": [
      "T14.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T14.G8.04",
    "title": "Document and analyze a complete game system",
    "short_name": "Explain game architecture and design choices",
    "topic_id": "T14",
    "topic_name": "2D Games & Interactive Simulations",
    "grade": 8,
    "description": "Students document their game: architecture diagram showing how systems connect, pseudocode or flowcharts for key algorithms, and written explanations of design choices (why they chose certain collision detection, what difficulty parameters they used, how enemy AI works). This reinforces reflection and communication of complex ideas.",
    "dependencies": [
      "T14.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T17.G6.01"
    ]
  },
  {
    "id": "T15.G7.01",
    "title": "Implement a scene graph or scene manager",
    "short_name": "Organize scenes using a scene system",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 7,
    "description": "Students design or implement a \"scene manager\" that tracks which scene is active, transitions between scenes automatically or on command, and maintains state across scene changes. This models real game and interactive media architecture.",
    "dependencies": [
      "T15.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T15.G7.02",
    "title": "Animate using sprite sheets and frame indices",
    "short_name": "Animate from a sprite sheet using frame numbers",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 7,
    "description": "Students work with a single sprite image containing multiple animation frames in a grid (a sprite sheet), and write code that displays the correct frame by setting costume index based on calculations (e.g., frame = walk_start + loop_counter).",
    "dependencies": [
      "T15.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T15.G7.03",
    "title": "Implement and compare branching narrative algorithms",
    "short_name": "Compare two different story branching approaches",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 7,
    "description": "Students implement or analyze two different methods for handling branching stories (e.g., nested if/else vs. a data-driven approach with choice tables) and reason about which is more maintainable, readable, or efficient as the story grows.",
    "dependencies": [
      "T15.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T15.G7.04",
    "title": "Evaluate narrative fairness and accessibility",
    "short_name": "Critique story design for inclusivity",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 7,
    "description": "Students play a story-game and critique it for narrative representation, accessibility (readability of text, clarity of instructions), and fairness (do all player paths feel equally rewarding?). They identify potential improvements.",
    "dependencies": [
      "T15.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T15.G8.01",
    "title": "Implement a narrative engine with state and dialogue data",
    "short_name": "Build a dialogue and story system",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 8,
    "description": "Students design and code a simple narrative engine that separates story data (dialogue, choices, state changes) from the presentation logic. For example, a \"dialogue table\" holds character lines and conditions; the engine checks conditions, displays the right line, and updates state.",
    "dependencies": [
      "T15.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T15.G8.02",
    "title": "Optimize animation performance with costume pooling",
    "short_name": "Manage animation memory efficiently",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 8,
    "description": "Students implement or describe techniques to reduce the number of costumes needed for smooth animation, such as reusing a single sprite and manipulating its size/rotation instead of swapping costumes, or implementing procedural animation using geometry.",
    "dependencies": [
      "T15.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T15.G8.03",
    "title": "Implement input handling and player agency",
    "short_name": "Responsive player controls in narrative",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 8,
    "description": "Students design a narrative experience where player input (keyboard, mouse, speech, gesture if available) meaningfully affects the story. They consider latency, feedback clarity, and fairness (does every path feel rewarded?).",
    "dependencies": [
      "T15.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T15.G8.04",
    "title": "Analyze narrative impacts: representation and bias",
    "short_name": "Critique story for representation and bias",
    "topic_id": "T15",
    "topic_name": "Stories, Animation & Digital Media",
    "grade": 8,
    "description": "Students analyze an interactive story (or their own) for representation of diverse characters, stereotypes, narrative bias (e.g., do all endings favor one choice or character type?), and fairness. They propose revisions.",
    "dependencies": [
      "T15.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G7.01",
    "title": "Build a data collection interface (survey or questionnaire)",
    "short_name": "Create a survey form with multiple input types",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 7,
    "description": "Students design an interface for a survey or questionnaire with text inputs, dropdowns, checkboxes, or radio buttons; validate responses; and collect the data. They learn how interfaces are used to gather information.",
    "dependencies": [
      "T16.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G7.02",
    "title": "Implement a search or filter interface",
    "short_name": "Search or filter a list using a text input",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 7,
    "description": "Students create a text input field where users can type a query, and the interface filters or searches a list of items (e.g., a player inventory, a menu of options) to show only matching results. This is a real-world UI pattern.",
    "dependencies": [
      "T16.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G7.03",
    "title": "Design an accessible interface for users with different abilities",
    "short_name": "Make a UI accessible for all players",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 7,
    "description": "Students consider accessibility needs (e.g., text size for low vision, keyboard controls for mobility challenges, colorblind-friendly palettes) and redesign an interface to accommodate multiple ability types. They learn to design inclusively from the start.",
    "dependencies": [
      "T16.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G7.04",
    "title": "Create a help or tutorial interface",
    "short_name": "Build an in-game help system",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 7,
    "description": "Students design a help or tutorial interface within a game, including explanatory labels, step-by-step instructions, images/animations, and a \"Next\" button to guide the player through mechanics or controls.",
    "dependencies": [
      "T16.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G8.01",
    "title": "Design a wizard or step-by-step interface",
    "short_name": "Create a multi-step wizard interface",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 8,
    "description": "Students build a \"wizard\" interface that guides users through a multi-step process (e.g., character creation, game setup, checkout) with Previous/Next buttons, progress indicators, and validation at each step. They manage state across multiple screens.",
    "dependencies": [
      "T16.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G8.02",
    "title": "Implement dynamic content loading in a UI",
    "short_name": "Load and display content based on user choices",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 8,
    "description": "Students design an interface where selecting an option dynamically loads and displays related content (e.g., clicking a character name displays their stats, clicking a level number shows the level preview). Content is retrieved from lists or variables.",
    "dependencies": [
      "T16.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G8.03",
    "title": "Analyze UI design patterns and their effectiveness",
    "short_name": "Compare two UI designs for a task",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 8,
    "description": "Students examine two different interface designs for the same task (e.g., two layouts for a settings menu, two ways to input a number) and evaluate which is more effective based on clarity, ease of use, and aesthetics. They write a brief analysis.",
    "dependencies": [
      "T16.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T16.G8.04",
    "title": "Document and refine a UI design based on usability testing",
    "short_name": "Test UI with users and iterate",
    "topic_id": "T16",
    "topic_name": "User Interfaces & Widgets",
    "grade": 8,
    "description": "Students conduct user testing of their interface (having peers try to complete a task using their interface, noting where they struggle), document observations, and refactor the interface to resolve usability issues. This reinforces the human-centered design cycle.",
    "dependencies": [
      "T16.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G7.01",
    "title": "Simulate friction in different media (water, air, ground)",
    "short_name": "Different surfaces have different friction",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 7,
    "description": "Students create multiple sprites sliding on surfaces with different friction values (high friction ground, low friction ice, medium friction carpet) and observe how each behaves differently.",
    "dependencies": [
      "T17.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G7.02",
    "title": "Apply multiple forces simultaneously",
    "short_name": "Combine forces for complex motion",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 7,
    "description": "Students apply more than one force to a sprite (e.g., gravity and wind, or gravity and a player-applied thrust) and observe the resulting motion as the vector sum of forces.",
    "dependencies": [
      "T17.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G7.03",
    "title": "Model a real physics scenario (pendulum, orbit, rolling object)",
    "short_name": "Simulate a real-world physics scenario",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 7,
    "description": "Students choose a real physics phenomenon (e.g., a pendulum, a ball rolling downhill, a satellite orbiting) and create a CreatiCode simulation that reasonably approximates the physics.",
    "dependencies": [
      "T17.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G7.04",
    "title": "Measure and analyze motion data (position, velocity, acceleration)",
    "short_name": "Track sprite motion data over time",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 7,
    "description": "Students log position, velocity, and/or acceleration of a physics-simulated sprite to a list or table, then analyze the data to verify expected physics patterns (e.g., constant acceleration under gravity).",
    "dependencies": [
      "T17.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G8.01",
    "title": "Design and balance a physics-based arcade game",
    "short_name": "Create a physics arcade game (Angry Birds style)",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 8,
    "description": "Students design a physics-based arcade game (similar to Angry Birds, a catapult puzzle, or a gravity-assisted platformer) where projectiles, gravity, and collisions are core mechanics.",
    "dependencies": [
      "T17.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G8.02",
    "title": "Optimize a physics simulation for performance",
    "short_name": "Improve simulation efficiency",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 8,
    "description": "Students work with a physics simulation that has many objects and optimize it by adjusting gravity updates, reducing collision checks, or culling off-screen objects to maintain smooth performance.",
    "dependencies": [
      "T17.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G8.03",
    "title": "Implement a physics constraint or joint",
    "short_name": "Connect objects with a physics joint",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 8,
    "description": "Students use advanced physics features (e.g., a weld joint, hinge joint, or distance constraint) to connect two sprites so they move together or rotate around a pivot.",
    "dependencies": [
      "T17.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T17.G8.04",
    "title": "Design a realistic vs stylized physics feel",
    "short_name": "Choose physics parameters for game feel",
    "topic_id": "T17",
    "topic_name": "Physics-Based Motion & Simulation",
    "grade": 8,
    "description": "Students design a game (e.g., platformer) with two variants: one with realistic physics and one with stylized (unrealistic but fun) physics. They compare and justify design choices.",
    "dependencies": [
      "T17.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T18.G7.01",
    "title": "Implement pathfinding or waypoint-based NPC movement",
    "short_name": "NPC navigation in 3D",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 7,
    "description": "Students create a non-player character (NPC) that moves between waypoints or toward a target position (player or goal) using distance calculations or a simple patrolling behavior.",
    "dependencies": [
      "T18.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T18.G7.02",
    "title": "Design collision response for bouncing or sliding",
    "short_name": "Custom collision response",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 7,
    "description": "Students use the 3D physics engine's properties (restitution, friction) to tune how objects respond to collisions: e.g., creating a bouncy ball, a sliding block, or a sticky object.",
    "dependencies": [
      "T18.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T18.G7.03",
    "title": "Use 3D coordinates and distance calculations for game mechanics",
    "short_name": "Distance and coordinate calculations in 3D",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 7,
    "description": "Students use distance formulas or conditional checks based on 3D positions (e.g., \"if player within 5 units of this object\") to trigger events or game logic, reinforcing spatial reasoning with numbers.",
    "dependencies": [
      "T18.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T18.G7.04",
    "title": "Implement a physics-based puzzle mechanic",
    "short_name": "Physics-based puzzle",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 7,
    "description": "Students design a simple puzzle that requires using physics-based manipulation: e.g., rolling a ball into a goal, stacking blocks to reach an object, or using gravity to guide an object.",
    "dependencies": [
      "T18.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T18.G8.01",
    "title": "Implement a level editor or dynamic level loading",
    "short_name": "Load and switch between 3D levels",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 8,
    "description": "Students use variables or lists to store level data (e.g., object types, positions, properties) and implement code to load different levels dynamically, enabling replay value and multiple game worlds.",
    "dependencies": [
      "T18.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T18.G8.02",
    "title": "Use multiple cameras to implement split-screen or UI view",
    "short_name": "Multiple camera systems",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 8,
    "description": "Students create a project with two cameras: one for the main 3D game view and one for a UI overlay (e.g., inventory, minimap, or score display), or split-screen for two players.",
    "dependencies": [
      "T18.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T18.G8.03",
    "title": "Analyze and optimize a 3D game for performance",
    "short_name": "Optimize 3D performance",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 8,
    "description": "Students examine a 3D project that runs slowly (e.g., many clones or physics objects), identify the bottleneck (e.g., too many draw calls, excessive physics calculations), and refactor to improve frame rate.",
    "dependencies": [
      "T18.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T18.G8.04",
    "title": "Analyze trade-offs in 3D game design decisions",
    "short_name": "Justify 3D design choices",
    "topic_id": "T18",
    "topic_name": "3D Worlds & Games",
    "grade": 8,
    "description": "Students review a 3D game project and explain design decisions: e.g., \"Why did I use physics for the player instead of manual movement?\" or \"Why is the camera positioned this way?\" reflecting on alternatives and trade-offs.",
    "dependencies": [
      "T18.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01"
    ]
  },
  {
    "id": "T19.G7.01",
    "title": "Design multiplayer game balance and fairness mechanisms",
    "short_name": "Build fair game mechanics for multiplayer",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 7,
    "description": "Students analyze or design multiplayer games with fairness in mind: equal starting positions, identical rules for all players, avoiding advantages from network latency, and balanced scoring systems. They discuss why fairness matters in multiplayer games.",
    "dependencies": [
      "T19.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T19.G7.02",
    "title": "Implement dynamic player matching or team assignment",
    "short_name": "Matchmake players into teams",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 7,
    "description": "Students use logic to automatically assign players to teams or matches based on criteria (e.g., first two players to join are a team, or random assignment). They may track team membership in a variable or list and ensure fair distribution.",
    "dependencies": [
      "T19.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T19.G7.03",
    "title": "Evaluate network efficiency: which data must be synced vs. local-only",
    "short_name": "Optimize what data is networked",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 7,
    "description": "Students analyze a multiplayer game and determine which variables should be synchronized across players (e.g., positions, shared score) and which can be local-only (e.g., individual power-up effects, temporary animations). They understand trade-offs between consistency and bandwidth.",
    "dependencies": [
      "T19.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T19.G7.04",
    "title": "Handle variable numbers of players (2, 3, 4, or more) in a single game",
    "short_name": "Scale multiplayer game for many players",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 7,
    "description": "Students design a multiplayer game that can accommodate more than two players. They use loops and lists to manage a variable number of player sprites, score entries, and positions, ensuring all players are treated fairly regardless of count.",
    "dependencies": [
      "T19.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T19.G8.01",
    "title": "Implement anti-cheat validation (server-side or consensus checking)",
    "short_name": "Prevent cheating in multiplayer games",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 8,
    "description": "Students implement basic anti-cheat measures: a shared validation rule (e.g., \"score can only increase by 1 per coin collection, not arbitrary amounts\") or a server-mediated authority (e.g., the host validates coin collection before updating the score). They understand the concept that trusted authorities prevent cheating.",
    "dependencies": [
      "T19.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T19.G8.02",
    "title": "Trace a message exchange to verify game state consistency",
    "short_name": "Verify game state across network messages",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 8,
    "description": "Students trace the sending and receiving of multiplayer messages (broadcasts, role-based sends) to ensure all players end up with consistent game state. They identify potential inconsistency bugs (e.g., message received out of order, or one player doesn't receive an update).",
    "dependencies": [
      "T19.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T19.G8.03",
    "title": "Design a multiplayer game with a persistent server/database for high scores or player data",
    "short_name": "Save multiplayer game data persistently",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 8,
    "description": "Students connect a multiplayer game to cloud storage or a database backend (using CreatiCode's cloud blocks or equivalent) to save and retrieve player data (high scores, achievements, player profiles) across sessions and matches. They understand that persistent data lives beyond a single game session.",
    "dependencies": [
      "T19.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T19.G8.04",
    "title": "Analyze the architecture and data flow of a multiplayer system",
    "short_name": "Understand multiplayer system design",
    "topic_id": "T19",
    "topic_name": "Multiplayer & Connected Apps",
    "grade": 8,
    "description": "Students examine the architecture of a multiplayer game system: client (player's game instance), server (shared authority), and network. They trace how a message flows from one client to the server, is processed, and broadcast back. They identify potential bottlenecks or failure points.",
    "dependencies": [
      "T19.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T14.G5.01",
      "T31.G5.01"
    ]
  },
  {
    "id": "T20.G7.01",
    "title": "Optimize an art algorithm for efficiency",
    "short_name": "Efficient art algorithms",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 7,
    "description": "Students compare two algorithms that produce similar art but differ in efficiency (e.g., one uses nested loops, another uses conditionals and single loop). They analyze which is faster and explain why.",
    "dependencies": [
      "T20.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T20.G7.02",
    "title": "Use advanced control flow in art (while, repeat-until)",
    "short_name": "Advanced loops in art",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 7,
    "description": "Students use a `repeat until` loop (e.g., draw until reaching screen edge) or a `while` condition in an art algorithm, introducing data-dependent looping rather than fixed-count repetition.",
    "dependencies": [
      "T20.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T20.G7.03",
    "title": "Understand how parameters change visual aesthetics",
    "short_name": "Parameter impact on art design",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 7,
    "description": "Students investigate how varying a parameter (pen size, angle increment, randomness level) changes the visual result and explain the relationship between the mathematical parameter and the aesthetic effect.",
    "dependencies": [
      "T20.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T20.G7.04",
    "title": "Recognize patterns in real-world algorithmic art and design",
    "short_name": "Analyze real generative art",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 7,
    "description": "Students study examples of algorithmic art or generative design from artists or nature (fractals, Penrose tilings, algorithmic music visualizers) and identify the underlying algorithmic principles.",
    "dependencies": [
      "T20.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T20.G8.01",
    "title": "Design and implement a complex data visualization",
    "short_name": "Advanced data visualization",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 8,
    "description": "Students design a script that visualizes a larger or more complex dataset (multiple variables, time series) in an artistic way. They choose how to represent data dimensions (color, size, position, animation) and justify their choices.",
    "dependencies": [
      "T20.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T20.G8.02",
    "title": "Create generative or randomized art with constrained variation",
    "short_name": "Constrained generative art",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 8,
    "description": "Students build an algorithm that uses randomness and loops to generate unique artwork on each run, but with constraints (e.g., a color palette, size limits, or symmetry rules) to maintain aesthetic quality.",
    "dependencies": [
      "T20.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T20.G8.03",
    "title": "Analyze social and creative implications of algorithms in art",
    "short_name": "Algorithms and creativity",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 8,
    "description": "Students explore how algorithmic choices affect the artistic result and discuss ethical/creative questions: Does algorithmic art count as \"real\" art? How do algorithm parameters influence what is created? Can algorithms replicate human creativity?",
    "dependencies": [
      "T20.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T20.G8.04",
    "title": "Optimize art rendering for performance",
    "short_name": "Optimize art code for speed",
    "topic_id": "T20",
    "topic_name": "Algorithmic Art & Creative Coding",
    "grade": 8,
    "description": "Students profile or analyze an art script and identify bottlenecks (e.g., too many draw calls, redundant calculations). They refactor to improve performance while maintaining visual output.",
    "dependencies": [
      "T20.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01"
    ]
  },
  {
    "id": "T21.G7.01",
    "title": "Explain why AI struggles with certain image types",
    "short_name": "Understand AI image generation limits",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 7,
    "description": "Students learn that AI image generators struggle with specific subjects: hands (often distorted), text (misspelled), complex mathematical patterns, or specific cultural imagery. They understand these limitations are due to training data gaps and model architecture, not lack of intelligence.",
    "dependencies": [
      "T21.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G7.02",
    "title": "Examine bias in AI-generated images and discuss causes",
    "short_name": "Recognize and discuss bias in AI art",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 7,
    "description": "Students systematically test AI image generators with prompts that should yield diverse results (e.g., \"a doctor,\" \"a teacher,\" \"a CEO\"). They observe whether the AI perpetuates stereotypes based on gender, race, age, or other factors, and discuss why training data bias causes this.",
    "dependencies": [
      "T21.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G7.03",
    "title": "Plan and execute an AI-heavy creative project with intentional choices",
    "short_name": "Lead a major project using AI media",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 7,
    "description": "Students design and build a substantial game or multimedia story (8+ screens/scenes) where AI-generated images are a primary asset source. They make intentional decisions about prompts, style consistency, and ethical considerations throughout the project.",
    "dependencies": [
      "T21.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G7.04",
    "title": "Compare creative workflows with and without AI tools",
    "short_name": "Compare hand-drawn vs. AI-assisted workflows",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 7,
    "description": "Students complete two similar creative tasks—one using only hand-drawn/remix assets and one using AI generation—and reflect on differences in time, effort, quality, and artistic satisfaction. This builds nuanced thinking about tool tradeoffs.",
    "dependencies": [
      "T21.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G7.05",
    "title": "Data Labeling Shapes AI Behavior",
    "short_name": "Labeling affects AI outcomes",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 7,
    "description": "Students understand how labeling choices affect model behavior and can introduce bias. They examine scenarios where different labelers might categorize the same data differently (e.g., is this image 'professional clothing' or 'casual clothing'?), and how those choices affect what the AI learns. They practice creating clear labeling guidelines to reduce inconsistency.",
    "dependencies": [
      "T21.G6.05",
      "T21.G6.01"
    ]
  },
  {
    "id": "T21.G8.01",
    "title": "Investigate questions of authorship and credit in AI-assisted art",
    "short_name": "Who made the art: human or AI?",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 8,
    "description": "Students explore the philosophical question: When a human writes an AI prompt and the AI generates an image, who is the \"artist\"? They research real-world debates (e.g., AI art competitions, copyright disputes) and form informed opinions on credit and ownership.",
    "dependencies": [
      "T21.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G8.02",
    "title": "Analyze how AI image generation might change creative industries",
    "short_name": "How will AI change art, animation, and game design?",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 8,
    "description": "Students examine how professional game studios, animators, and illustrators are (or might) adopt AI tools. They consider both opportunities (faster prototyping, accessibility) and concerns (job displacement, cultural homogenization). This develops systems thinking about technology and society.",
    "dependencies": [
      "T21.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G8.03",
    "title": "Design an AI-assisted creative workflow for a realistic scenario",
    "short_name": "Plan an AI workflow for a game or film studio",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 8,
    "description": "Students design a realistic workflow for a small indie game or animation team using AI image generation for concept art, backgrounds, or character variations. They consider quality, consistency, revision cycles, and team roles. This applies AI tool knowledge to authentic professional contexts.",
    "dependencies": [
      "T21.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G8.04",
    "title": "Evaluate the ethical implications of large-scale AI deployment in creative fields",
    "short_name": "Is it ethical to use AI in creative industries?",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 8,
    "description": "Students evaluate multi-faceted ethical questions: Should creators be required to disclose AI use? Does AI democratize creativity or homogenize it? What happens to artists whose work was used to train AI? They form nuanced positions informed by multiple perspectives.",
    "dependencies": [
      "T21.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T15.G5.01"
    ]
  },
  {
    "id": "T21.G8.05",
    "title": "Design an AI Project Plan",
    "short_name": "Plan AI with all roles",
    "topic_id": "T21",
    "topic_name": "AI Media Tools & Creative Assets",
    "grade": 8,
    "description": "Students design a complete plan for building an AI model, including: defining the problem, identifying needed roles and skills, planning data collection and labeling strategy, choosing evaluation metrics, and considering ethical implications. They document all human roles required and decisions humans must make throughout the process.",
    "dependencies": [
      "T21.G7.05",
      "T21.G7.01"
    ]
  },
  {
    "id": "T22.G7.01",
    "title": "Design a multi-intent chatbot",
    "short_name": "Chatbot that handles different user goals",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 7,
    "description": "Students design and build a chatbot that can recognize when a user wants different things (e.g., get information, ask for help, provide feedback) and respond appropriately to each intent.",
    "dependencies": [
      "T22.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T22.G7.02",
    "title": "Build a chatbot that learns from user feedback",
    "short_name": "Chatbot that improves over time",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 7,
    "description": "Students implement a chatbot that logs user interactions and feedback, using the data to identify common questions or problematic responses to improve future versions.",
    "dependencies": [
      "T22.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T22.G7.03",
    "title": "Integrate external data into chatbot responses",
    "short_name": "Use live data in a chatbot",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 7,
    "description": "Students enhance a chatbot by fetching or referencing external data sources (e.g., a spreadsheet, an API call simulation, or sensor data) to provide current or dynamic information.",
    "dependencies": [
      "T22.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T22.G7.04",
    "title": "Analyze societal impacts of chatbot misinformation",
    "short_name": "Understand risks of AI information systems",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 7,
    "description": "Students investigate how chatbots can spread misinformation or false information, discuss the societal consequences, and brainstorm safeguards.",
    "dependencies": [
      "T22.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T22.G8.01",
    "title": "Extract key information from user input",
    "short_name": "Parse user intent from natural language",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 8,
    "description": "Students implement logic to identify key entities or keywords in user questions (e.g., \"Book by Roald Dahl\" → extract \"Roald Dahl\" as author) to improve chatbot responses or data lookups.",
    "dependencies": [
      "T22.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T22.G8.02",
    "title": "Design and run chatbot performance tests",
    "short_name": "Test chatbot accuracy and quality",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 8,
    "description": "Students create test cases for a chatbot (predefined questions with expected answers) and run them to measure accuracy, identifying which types of questions the chatbot handles well or poorly.",
    "dependencies": [
      "T22.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T22.G8.03",
    "title": "Compare different chatbot designs for a task",
    "short_name": "Evaluate design trade-offs in chatbots",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 8,
    "description": "Students implement two different approaches to the same chatbot task (e.g., rule-based lookup vs. ChatGPT-only, or different prompt strategies) and compare them on metrics like accuracy, speed, and user satisfaction.",
    "dependencies": [
      "T22.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T22.G8.04",
    "title": "Discuss ethical design and deployment of information bots",
    "short_name": "Ethics and responsibility in AI information systems",
    "topic_id": "T22",
    "topic_name": "AI Chatbots & Information Apps",
    "grade": 8,
    "description": "Students engage in structured discussion or written reflection about ethical responsibilities when deploying chatbots (e.g., transparency about AI use, managing user expectations, preventing harm, protecting privacy).",
    "dependencies": [
      "T22.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T29.G5.01"
    ]
  },
  {
    "id": "T23.G7.01",
    "title": "Design and test a hands-free app interface",
    "short_name": "Build a voice-controlled interface",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 7,
    "description": "Students design a small application (e.g., a quiz, a music player, a story reader) where all controls are voice-based. They test the interface with multiple users to evaluate how well voice commands are understood.",
    "dependencies": [
      "T23.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T23.G7.02",
    "title": "Combine multiple AI modalities (voice + vision) in one project",
    "short_name": "Multi-modal interaction",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 7,
    "description": "Students create a project that meaningfully uses both voice and vision (or gesture) at the same time, where each modality contributes distinct information (e.g., voice gives commands, vision confirms who is speaking or detects a pose to enable the command).",
    "dependencies": [
      "T23.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T23.G7.03",
    "title": "Measure and optimize gesture recognition accuracy",
    "short_name": "Test gesture accuracy",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 7,
    "description": "Students design a gesture (e.g., a thumbs-up, a specific hand shape, or pose) and test how consistently the system detects it. They measure accuracy (number of correct detections / total attempts) and try to improve it by refining the detection logic or providing clearer instructions to users.",
    "dependencies": [
      "T23.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T23.G7.04",
    "title": "Explain how AI voice/vision features affect user experience",
    "short_name": "Accessibility and inclusion with AI",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 7,
    "description": "Students reflect on how voice and vision recognition technologies enable or restrict access for different user groups (e.g., voice helps non-typists, but fails for those who are non-verbal; gesture recognition may miss people with limited mobility). They identify potential improvements.",
    "dependencies": [
      "T23.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T23.G8.01",
    "title": "Implement a complete voice-to-action pipeline with error handling",
    "short_name": "Robust voice command system",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 8,
    "description": "Students build a voice application that includes speech recognition, command parsing/matching, error handling for misheard words, and feedback to the user. The system is robust enough to handle real-world speech variations (e.g., \"go left\" vs \"turn left\").",
    "dependencies": [
      "T23.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T23.G8.02",
    "title": "Analyze pose data to classify or predict movement patterns",
    "short_name": "Predict movement from pose",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 8,
    "description": "Students collect pose data while a person performs different movements (e.g., walking, jumping, standing still) and use a table to organize and analyze the data. They look for patterns (e.g., differences in keypoint velocities, distances, or angles) that distinguish one movement from another.",
    "dependencies": [
      "T23.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T23.G8.03",
    "title": "Design and justify a voice/vision accessibility feature",
    "short_name": "Create an accessible feature",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 8,
    "description": "Students design a feature of an existing game or app that uses voice or vision to improve accessibility for a specific user group (e.g., a text-to-speech narrator for a reading game, hand-gesture controls for a player with limited fine motor control). They justify their design with evidence from user testing or accessibility research.",
    "dependencies": [
      "T23.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T23.G8.04",
    "title": "Evaluate and mitigate bias in AI detection systems",
    "short_name": "Test and reduce bias in AI",
    "topic_id": "T23",
    "topic_name": "AI Voice, Vision & Gesture Interfaces",
    "grade": 8,
    "description": "Students build or use a pose/gesture/speech detection system and systematically test it across different demographic groups, lighting conditions, accents, etc. They measure and document disparities in accuracy and propose mitigations.",
    "dependencies": [
      "T23.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01"
    ]
  },
  {
    "id": "T24.G7.01",
    "title": "Ask XO about edge cases and robustness",
    "short_name": "Plan for edge cases with XO",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 7,
    "description": "Before or after implementing a solution, a student asks XO \"What edge cases might break my code?\" or \"How do I make my solution more robust?\" XO suggests cases (negative numbers, empty lists, etc.). The student tests or implements guards against them.",
    "dependencies": [
      "T24.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G7.02",
    "title": "Discuss trade-offs: speed vs. clarity with XO",
    "short_name": "Evaluate design trade-offs",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 7,
    "description": "Students understand that many coding decisions involve trade-offs (a loop is faster but a function call is clearer; a variable is flexible but a constant is predictable). They ask XO \"Which is better for my goal?\" and make informed choices based on their priorities.",
    "dependencies": [
      "T24.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G7.03",
    "title": "Use XO to refactor and improve existing code",
    "short_name": "Ask XO for refactoring ideas",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 7,
    "description": "After completing a working solution, a student shows it to XO and asks \"How could I make this better?\" XO suggests refactoring (extract a function, use a data structure, simplify a condition). The student implements one or two suggestions and documents why.",
    "dependencies": [
      "T24.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G7.04",
    "title": "Critique XO's suggestions against your priorities",
    "short_name": "Evaluate whether XO's idea fits your project",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 7,
    "description": "XO might suggest a sophisticated optimization or feature that's technically sound but doesn't align with a student's project goals (e.g., XO suggests a complex sorting algorithm when the student's list is tiny, or XO suggests a 3D feature when the project is 2D). Students learn to say \"That's smart, but not what I need for this project\" and explain why.",
    "dependencies": [
      "T24.G6.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G7.05",
    "title": "Document AI Limitations: Model Card Basics",
    "short_name": "Create simple model card",
    "topic_id": "T24",
    "topic_name": "Coding with AI (XO & AI-Supported Coding)",
    "grade": 7,
    "description": "Students create an AI model (e.g., classifier, recommendation system) and document its limitations in a simplified model card format: (1) What it does, (2) What data it was trained on, (3) How accurate it is, (4) What it does well, (5) What it does poorly, (6) Who should/shouldn't use it. They learn that responsible AI creators document limitations honestly.",
    "dependencies": [
      "T24.G6.05",
      "T21.G7.05"
    ]
  },
  {
    "id": "T24.G8.01",
    "title": "Use XO to help document a complex project",
    "short_name": "Generate documentation with XO",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 8,
    "description": "After completing a multi-feature project, a student shows XO the code and asks \"Help me write clear documentation for a peer to understand this.\" XO provides a structured outline (overview, features, code breakdown). The student refines it with their own details and perspective, creating a hybrid human-AI document.",
    "dependencies": [
      "T24.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G8.02",
    "title": "Reflect on your coding decisions with XO's help",
    "short_name": "Use XO for self-reflection",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 8,
    "description": "A student completes a project and asks XO \"What strengths do you see in my code?\" or \"What would I improve if I had more time?\" XO provides feedback. The student integrates this with their own self-assessment (\"I was proud that I used a loop to reduce repetition. Next time, I'd…\").",
    "dependencies": [
      "T24.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G8.03",
    "title": "Ask XO to help debug by explaining your hypothesis",
    "short_name": "Use XO to test debugging theories",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 8,
    "description": "Before diving into code, a student tells XO their hypothesis about a bug (\"I think the sprite is stuck because the loop never ends\"). XO helps them design a test (add a print statement, add a timer, etc.). The student tests and reports back. This combines logical reasoning with AI-assisted verification.",
    "dependencies": [
      "T24.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G8.04",
    "title": "Recognize and mitigate limitations of XO-assisted code",
    "short_name": "Verify XO code quality",
    "topic_id": "T24",
    "topic_name": "XO & AI‑Supported Coding Practices",
    "grade": 8,
    "description": "Sometimes XO-generated code or suggestions work but aren't ideal (inefficient, unclear, not fully correct). Grade 8 students learn to review code XO suggests, test it thoroughly, and either adopt it with understanding or revise it. They practice the principle: \"AI is a tool, not an authority.\"",
    "dependencies": [
      "T24.G7.01",
      "T06.G5.01",
      "T07.G5.01",
      "T08.G5.01",
      "T09.G5.01",
      "T10.G5.01",
      "T11.G5.01",
      "T12.G5.01",
      "T13.G5.01",
      "T21.G6.01",
      "T22.G6.01"
    ]
  },
  {
    "id": "T24.G8.05",
    "title": "Build Ethical AI with Full Documentation",
    "short_name": "AI app with complete model card",
    "topic_id": "T24",
    "topic_name": "Coding with AI (XO & AI-Supported Coding)",
    "grade": 8,
    "description": "Students develop an AI application using APIs or tools (e.g., image generation, text analysis, recommendation system) with complete ethical documentation: (1) full model card describing capabilities and limitations, (2) fairness evaluation across diverse test cases, (3) bias mitigation strategies implemented, (4) clear usage guidelines for users, (5) transparency about how decisions are made. This is a capstone ethical AI development project.",
    "dependencies": [
      "T24.G7.05",
      "T21.G8.05",
      "T22.G7.01"
    ]
  },
  {
    "id": "T25.G7.01",
    "title": "Represent numbers at different precision levels",
    "short_name": "Understand precision in numeric data",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 7,
    "description": "Students explore how the precision of numeric data affects storage and meaning (e.g., rounding 3.14159 to 3.14, storing temperature to the nearest degree vs. tenth), understanding trade-offs.",
    "dependencies": [
      "T25.G6.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G7.02",
    "title": "Use nested data structures to represent complex information",
    "short_name": "Store complex data in lists and tables",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 7,
    "description": "Students create or work with nested structures (e.g., a list of tables, where each table represents a player with multiple attributes) to model real-world complexity.",
    "dependencies": [
      "T25.G5.02",
      "T25.G6.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G7.03",
    "title": "Evaluate the appropriateness of a data type for a task",
    "short_name": "Pick the right data type",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 7,
    "description": "Students analyze a project scenario and make evidence-based decisions about what data types to use, considering what operations will be needed and what values are expected.",
    "dependencies": [
      "T25.G6.01",
      "T25.G6.05",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T25.G7.04",
    "title": "Handle missing or invalid data in a program",
    "short_name": "Deal with incomplete or wrong data",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 7,
    "description": "Students write code that gracefully handles missing values (e.g., a player with no high score) or invalid input, understanding data quality issues.",
    "dependencies": [
      "T25.G3.01",
      "T25.G7.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G7.05",
    "title": "Compare storage and efficiency of different data representations",
    "short_name": "Choose efficient ways to store data",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 7,
    "description": "Students compare two ways of representing the same information (e.g., storing 5 items as individual variables vs. a list, or as a single tally number) and reason about efficiency and clarity.",
    "dependencies": [
      "T25.G4.05",
      "T25.G7.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G8.01",
    "title": "Design a complete data schema for a project",
    "short_name": "Plan your data structure",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 8,
    "description": "Students design a detailed plan for what data a project will store, including all variable types, relationships, and constraints (e.g., \"score must be non-negative,\" \"player name is required\").",
    "dependencies": [
      "T25.G6.03",
      "T25.G7.02",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G8.02",
    "title": "Recognize bias and limitations in data representation",
    "short_name": "Think critically about how data is encoded",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 8,
    "description": "Students explore how choices in data representation can introduce bias or lose important information (e.g., representing gender as only \"boy\" or \"girl,\" categorizing ages into broad ranges, using single-language labels).",
    "dependencies": [
      "T25.G3.01",
      "T25.G7.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G8.03",
    "title": "Use advanced data structures for algorithms",
    "short_name": "Choose data structures for efficiency",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 8,
    "description": "Students select appropriate data structures (lists, tables, or dictionaries) for an algorithmic task, understanding that the choice affects how efficiently the program can search, sort, or process data.",
    "dependencies": [
      "T25.G7.02",
      "T25.G7.05",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G8.04",
    "title": "Explore how data type mismatches cause errors",
    "short_name": "Debug data type errors",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 8,
    "description": "Students encounter and fix programs where incorrect operations are performed on wrong data types (e.g., adding the text \"5\" to the number 10, or trying to sort mixed data types incorrectly), understanding type constraints.",
    "dependencies": [
      "T25.G7.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01"
    ]
  },
  {
    "id": "T25.G8.05",
    "title": "Evaluate how data representation affects real-world decisions",
    "short_name": "Understand data representation's impact",
    "topic_id": "T25",
    "topic_name": "Data Representation & Simple Data Types",
    "grade": 8,
    "description": "Students analyze real-world scenarios where data representation choices have consequences (e.g., how credit scores are calculated, how student grades are recorded, how census categories are defined) and discuss ethical implications.",
    "dependencies": [
      "T25.G8.01",
      "T25.G8.02",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T26.G7.01",
    "title": "Formulate a clear, testable data question",
    "short_name": "Ask a data-driven question",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 7,
    "description": "Students formulate a specific data question that can be answered by collecting and analyzing data, distinguishing it from questions answered by opinion or general knowledge. Examples: \"Do taller students jump higher?\" \"Which type of music gets the most plays in our class?\"",
    "dependencies": [
      "T26.G6.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G7.02",
    "title": "Collect data systematically using lists and tables",
    "short_name": "Conduct a data collection campaign",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 7,
    "description": "Students execute a planned data collection (20-50 data points across 3-4 columns), recording data into a CreatiCode table or list. They maintain data quality by following consistent procedures.",
    "dependencies": [
      "T26.G7.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G7.03",
    "title": "Manipulate data with code (filter, sort, aggregate)",
    "short_name": "Process data using loops and conditions",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 7,
    "description": "Students write code that reads from a table or list, applies filters (keep only rows where a condition is true) or sorts (arrange by a column), or calculates aggregates (sum, average, count) to prepare data for analysis.",
    "dependencies": [
      "T26.G5.03",
      "T26.G7.02",
      "T26.G6.05",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T11.G4.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G7.04",
    "title": "Identify and correct data quality issues",
    "short_name": "Debug and repair data",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 7,
    "description": "Students systematically review collected data, identify specific quality issues (duplicates, out-of-range values, inconsistent units, missing entries), and apply appropriate fixes. They document what was wrong and how they fixed it.",
    "dependencies": [
      "T26.G6.05",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G7.05",
    "title": "Draw simple conclusions from organized data",
    "short_name": "Interpret data to answer questions",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 7,
    "description": "Students examine their collected and cleaned dataset and use it to answer the original data question. They identify the most common value, the largest/smallest, trends, or comparisons between groups, and state a simple conclusion.",
    "dependencies": [
      "T26.G7.03",
      "T26.G7.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G8.01",
    "title": "Design an ethical data collection process",
    "short_name": "Plan ethical data practices",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 8,
    "description": "Students design a data collection for a research question while considering ethical issues: privacy (what personal data is necessary), consent (asking permission to collect data), fairness (including diverse participants, avoiding bias), and transparency (telling people what their data will be used for).",
    "dependencies": [
      "T26.G7.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G8.02",
    "title": "Execute a complete data investigation (question to analysis)",
    "short_name": "Conduct a full data investigation",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 8,
    "description": "Students execute an end-to-end data investigation: ask a testable question, collect 30-100 data points across multiple attributes, organize into a table, clean the data, filter/aggregate as needed, analyze to answer the question, and write a brief summary of findings and any limitations.",
    "dependencies": [
      "T26.G7.01",
      "T26.G7.02",
      "T26.G7.05",
      "T26.G7.03",
      "T26.G7.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T11.G4.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G8.03",
    "title": "Analyze relationships between variables in data",
    "short_name": "Find connections between data columns",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 8,
    "description": "Students work with a multi-column dataset and analyze relationships between variables (e.g., \"Do students who read more books also have higher vocabulary scores?\" or \"Is there a pattern between hours of screen time and sleep quality?\"). They use filtering, sorting, or visual inspection to identify patterns.",
    "dependencies": [
      "T26.G7.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T11.G4.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G8.04",
    "title": "Recognize bias and limitations in data collection",
    "short_name": "Spot bias and limitations",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 8,
    "description": "Students examine a dataset or a data collection process and identify potential biases (e.g., sampling only from one school excludes other communities, asking questions on an app excludes people without internet) and limitations (e.g., small sample size, measurements taken at only one time). They reflect on how these affect conclusions.",
    "dependencies": [
      "T26.G8.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T26.G8.05",
    "title": "Use cloud storage or multiplayer data to conduct group research",
    "short_name": "Collaborate on shared data",
    "topic_id": "T26",
    "topic_name": "Data Collection & Organization",
    "grade": 8,
    "description": "Students work in a group to collect data where each member contributes to a shared table or list (using CreatiCode's cloud or multiplayer blocks), then collectively analyze the combined dataset. This introduces collaborative data science and networked data collection.",
    "dependencies": [
      "T26.G6.03",
      "T26.G8.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T25.G3.01"
    ]
  },
  {
    "id": "T27.G7.01",
    "title": "Simulate data collection and compute statistics",
    "short_name": "Run simulations and analyze the results",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 7,
    "description": "Students create a loop-based simulation (e.g., simulating a chance experiment, rolling dice, or surveying random responses) and track results in a list or tally variables. They then analyze the simulated data (compute average, count outcomes) to estimate probabilities or expected values.",
    "dependencies": [
      "T27.G6.02",
      "T27.G5.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T27.G7.02",
    "title": "Identify and describe bias in data collection",
    "short_name": "Spot bias in how data was collected",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 7,
    "description": "Students examine a data-collection scenario (e.g., a survey conducted only at recess, a sample that doesn't represent everyone) and identify potential sources of bias. They explain how bias might skew the results.",
    "dependencies": [
      "T27.G7.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T27.G7.03",
    "title": "Analyze trends over time and make predictions",
    "short_name": "Follow trends to predict future values",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 7,
    "description": "Students examine a time-series chart (e.g., daily temperature, monthly website visits, population growth) and describe the trend. They then make a reasonable prediction about what will happen next (e.g., \"The temperature has been rising each day; it will probably rise again tomorrow\").",
    "dependencies": [
      "T27.G6.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T27.G7.04",
    "title": "Compare distributions of data",
    "short_name": "Compare shape and spread of two datasets",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 7,
    "description": "Students compare two datasets (e.g., two classes' test scores, rainfall in two cities) by looking at their distributions: shape (skew, symmetry), center (mean or median), and spread (range, variability). They describe which dataset is more consistent or has more extreme values.",
    "dependencies": [
      "T27.G6.02",
      "T27.G5.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T27.G8.01",
    "title": "Design and conduct a simple data investigation",
    "short_name": "Ask a question, collect, analyze, and conclude",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 8,
    "description": "Students develop a data question, design a collection method, gather data using CreatiCode (e.g., a survey project, simulation, or sensor logging), organize and analyze the data (computing summaries and visualizations), and write a conclusion supported by the data.",
    "dependencies": [
      "T27.G7.01",
      "T27.G6.02",
      "T27.G6.01",
      "T27.G5.02",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T27.G8.02",
    "title": "Analyze two variables for potential causal relationships",
    "short_name": "Explore whether one variable affects another",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 8,
    "description": "Students investigate whether a relationship between two variables suggests causation (e.g., does study time cause higher test scores?) or is merely correlation. They consider alternative explanations and limitations of the data.",
    "dependencies": [
      "T27.G6.03",
      "T27.G7.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T27.G8.03",
    "title": "Create an interactive data dashboard",
    "short_name": "Build a tool to explore data with controls",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 8,
    "description": "Students use CreatiCode widgets (sliders, buttons, dropdowns) to build an interactive dashboard that displays filtered or grouped data, allowing users to adjust parameters and see updated visualizations. This combines data analysis with UI design.",
    "dependencies": [
      "T27.G6.04",
      "T27.G5.03",
      "T27.G6.02",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T27.G8.04",
    "title": "Evaluate and justify data-driven conclusions",
    "short_name": "Support a conclusion with data evidence",
    "topic_id": "T27",
    "topic_name": "Data Analysis & Visualization",
    "grade": 8,
    "description": "Students examine a data-driven conclusion or argument (e.g., \"Our school should extend recess because students are happier\") and evaluate it critically: Is the data sufficient? Is the conclusion justified? What alternative explanations exist? What data would strengthen or weaken the argument?",
    "dependencies": [
      "T27.G8.01",
      "T27.G8.02",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T25.G3.01",
      "T26.G3.01"
    ]
  },
  {
    "id": "T28.G7.01",
    "title": "Conduct a full multi-step experiment with hypothesis",
    "short_name": "Test a hypothesis with an experiment",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 7,
    "description": "Students formulate a clear hypothesis (prediction), design an experiment to test it (with controls, variables, and sample size decisions), collect data, and draw conclusions, practicing the scientific method within a probability or observational context.",
    "dependencies": [
      "T28.G6.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T28.G7.02",
    "title": "Implement a Monte Carlo simulation to estimate a probability",
    "short_name": "Run 1000s of trials to estimate odds",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 7,
    "description": "Students code a simulation using a large number of iterations (e.g., 1000 or 10,000 trials) to empirically estimate a complex probability (e.g., chance of rolling three dice that sum to 10, or chance of at least two people sharing a birthday in a room of 20). They interpret the frequency as a probability estimate.",
    "dependencies": [
      "T28.G7.01",
      "T28.G5.02",
      "T28.G6.02",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T28.G7.03",
    "title": "Analyze sources of bias in data collection and its impact",
    "short_name": "How did bias affect the results?",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 7,
    "description": "Students examine a real or simulated dataset known to have bias (e.g., results from a survey taken only online, results from a controlled experiment run only in one location), analyze how the bias occurred, and reason about how the results would differ if the bias were eliminated.",
    "dependencies": [
      "T28.G5.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T11.G4.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T28.G7.04",
    "title": "Conduct a sampling experiment and compare to population parameter",
    "short_name": "Does your sample match the whole group?",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 7,
    "description": "Students take multiple random samples from a known population (real or simulated), compute a statistic (e.g., mean, proportion) for each sample, and compare sample statistics to the true population parameter, building intuition about sampling variability and estimators.",
    "dependencies": [
      "T28.G7.01",
      "T28.G5.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T28.G8.01",
    "title": "Design and conduct an experiment addressing a real question",
    "short_name": "Run an experiment to answer your question",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 8,
    "description": "Students develop their own research question, design an experiment or survey to answer it (including decisions about variables, controls, sample size, and data collection method), conduct the experiment, analyze results, and communicate findings. This is a capstone skill integrating earlier concepts.",
    "dependencies": [
      "T28.G7.01",
      "T28.G7.02",
      "T28.G7.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T28.G8.02",
    "title": "Estimate probability using large-scale simulation or real data",
    "short_name": "Estimate odds from data",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 8,
    "description": "Students estimate the probability of a complex or uncertain event (e.g., a hurricane, a sports outcome) by analyzing historical data or running a sophisticated Monte Carlo simulation with many variables, integrating lists, loops, and conditional logic.",
    "dependencies": [
      "T28.G7.02",
      "T28.G7.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T28.G8.03",
    "title": "Analyze bias in AI models trained on biased data",
    "short_name": "How does biased data hurt AI?",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 8,
    "description": "Students learn that AI systems trained on biased datasets produce biased outputs, and can examine examples (e.g., if a training dataset has more images of one gender, the model may perform worse on that gender). They reason about consequences and potential fixes.",
    "dependencies": [
      "T28.G7.03",
      "T28.G8.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T28.G8.04",
    "title": "Evaluate ethical considerations in data-driven decisions",
    "short_name": "Is it fair to decide this way?",
    "topic_id": "T28",
    "topic_name": "Chance, Sampling & Experiments",
    "grade": 8,
    "description": "Students examine a real-world scenario where a decision is made using data (e.g., hiring, lending, school admissions, content recommendation) and analyze ethical concerns: Is the data biased? Will the decision harm some groups? What are privacy implications? Should people be informed and given agency?",
    "dependencies": [
      "T28.G8.01",
      "T28.G8.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T29.G7.01",
    "title": "Pre‑process text for analysis",
    "short_name": "Prepare text for analysis",
    "topic_id": "T29",
    "topic_name": "Text Data & Introductory NLP",
    "grade": 7,
    "description": "Students perform multiple preprocessing steps on text (remove punctuation, convert to lowercase, trim spaces, remove common words) to prepare it for analysis or AI processing, learning data cleaning for text.",
    "dependencies": [
      "T29.G6.01",
      "T29.G4.04",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T29.G7.02",
    "title": "Compute text similarity or comparison",
    "short_name": "Compare how similar two texts are",
    "topic_id": "T29",
    "topic_name": "Text Data & Introductory NLP",
    "grade": 7,
    "description": "Students use AI or string matching logic to assess similarity between two text passages, learning that text similarity can be computed and compared.",
    "dependencies": [
      "T29.G7.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T29.G7.03",
    "title": "Use AI to answer questions based on a text passage\n\n- **Smart Retrieval:** Ask AI questions about text\n- **Description:** Students use a ChatGPT prompt that provides context (e.g., a passage) and asks a question about it, learning how AI can retrieve and synthesize information from text.\n- **Challenge format:** Coding, question‑answering project. Provided: a passage. Students ask ChatGPT: \"Based on this text: [passage], what is [question]?\" and process the response. Auto‑grading checks answer validity against expected responses.\n- **CSTA:** MS‑PRO‑PF‑01, CAS‑ET‑05 (Emerging technologies in innovative ways).\n\n### T29.G7.04 – Reflect on bias and fairness in text data and AI responses",
    "short_name": "Think about bias in text and AI",
    "topic_id": "T29",
    "topic_name": "Text Data & Introductory NLP",
    "grade": 7,
    "description": "Students examine how text datasets or AI models might reflect or introduce bias, learning critical thinking about text processing and AI fairness.",
    "dependencies": [
      "T29.G6.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T29.G8.01",
    "title": "Build a keyword search and retrieval system",
    "short_name": "Create a keyword search tool",
    "topic_id": "T29",
    "topic_name": "Text Data & Introductory NLP",
    "grade": 8,
    "description": "Students design a project that takes user input (keywords) and searches a collection of text documents (or passages in a list), returning matching documents. This is a simplified version of real search engines.",
    "dependencies": [
      "T29.G6.02",
      "T29.G7.01",
      "T29.G7.02",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T29.G8.02",
    "title": "Analyze sentiment or emotion in multiple texts using AI",
    "short_name": "Analyze emotions in text samples",
    "topic_id": "T29",
    "topic_name": "Text Data & Introductory NLP",
    "grade": 8,
    "description": "Students apply an AI model (via ChatGPT) to analyze sentiment or emotion in a batch of text samples, then aggregate and visualize the results (e.g., how many positive, negative, neutral texts are in the set).",
    "dependencies": [
      "T29.G6.03",
      "T29.G7.03",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T29.G8.03",
    "title": "Extract entities or relationships from text using AI",
    "short_name": "Find names and connections in text",
    "topic_id": "T29",
    "topic_name": "Text Data & Introductory NLP",
    "grade": 8,
    "description": "Students use AI (ChatGPT) to extract named entities (people, places, organizations) or relationships from text, learning that AI can identify and structure information from unstructured text.",
    "dependencies": [
      "T29.G7.03",
      "T29.G8.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T08.G3.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T29.G8.04",
    "title": "Evaluate the ethical implications of text processing and NLP",
    "short_name": "Discuss ethics of text AI",
    "topic_id": "T29",
    "topic_name": "Text Data & Introductory NLP",
    "grade": 8,
    "description": "Students analyze and discuss complex issues: how NLP systems might perpetuate biases, privacy concerns with text collection, and the use of NLP in surveillance or manipulation. They propose mitigations.",
    "dependencies": [
      "T29.G8.02",
      "T29.G8.03",
      "T29.G8.01",
      "T09.G3.01",
      "T10.G3.01",
      "T07.G3.01",
      "T11.G4.01",
      "T27.G3.01"
    ]
  },
  {
    "id": "T30.G7.01",
    "title": "Understand operating systems and system software",
    "short_name": "How operating systems work",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 7,
    "description": "Students understand that an operating system (Windows, macOS, iOS, Android, Linux) is software that manages hardware resources (CPU, memory, storage, peripherals) and allows other software to run. They can name common operating systems and describe their role in a computing system.",
    "dependencies": [
      "T30.G6.01"
    ]
  },
  {
    "id": "T30.G7.02",
    "title": "Diagnose and resolve complex hardware/software issues",
    "short_name": "Troubleshoot complex problems",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 7,
    "description": "Students apply multi-step troubleshooting to diagnose and resolve complex issues that may involve hardware, software, OS, or user error. They document steps and verify solutions.",
    "dependencies": [
      "T30.G6.01"
    ]
  },
  {
    "id": "T30.G7.03",
    "title": "Understand hardware performance and constraints",
    "short_name": "Hardware limits and performance",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 7,
    "description": "Students understand how hardware specifications (CPU speed, RAM, storage size, screen resolution) affect system performance and capabilities. They can explain why a program might be slow or why a device can't run certain software.",
    "dependencies": [
      "T30.G6.01"
    ]
  },
  {
    "id": "T30.G7.04",
    "title": "Design a more complex simulated system",
    "short_name": "Multi-layer system simulation",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 7,
    "description": "Students design a CreatiCode simulation of a more complex system (e.g., a home automation system with multiple sensors, user controls, and coordinated outputs; a game with multiple sprites each responding to sensors and user input; a data-collecting weather station).",
    "dependencies": [
      "T30.G6.01"
    ]
  },
  {
    "id": "T30.G8.01",
    "title": "Describe computing devices in industry",
    "short_name": "Computers and devices in the real world",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 8,
    "description": "Students research and describe computing devices used in various industries (robots in manufacturing, medical imaging devices, electronic control units in vehicles, sensors in agriculture, smart systems in buildings). They explain how each device combines hardware, software, and sensors to accomplish its purpose.",
    "dependencies": [
      "T30.G7.01"
    ]
  },
  {
    "id": "T30.G8.02",
    "title": "Understand how software is deployed and updated",
    "short_name": "Software distribution and updates",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 8,
    "description": "Students understand that software is developed, tested, packaged, and distributed to devices (app stores, downloads, cloud services), and that updates patch bugs, add features, and improve security. They can explain why updates are important.",
    "dependencies": [
      "T30.G7.01"
    ]
  },
  {
    "id": "T30.G8.03",
    "title": "Apply advanced troubleshooting and system diagnosis",
    "short_name": "Advanced system troubleshooting",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 8,
    "description": "Students apply advanced troubleshooting: checking system logs, managing startup programs, diagnosing network issues, testing hardware components, and considering interactions between hardware, OS, and software. They document findings and propose solutions.",
    "dependencies": [
      "T30.G7.01"
    ]
  },
  {
    "id": "T30.G8.04",
    "title": "Build a comprehensive system simulation",
    "short_name": "Full system design and simulation",
    "topic_id": "T30",
    "topic_name": "Devices, Hardware, Physical Computing & Software",
    "grade": 8,
    "description": "Students design and implement a comprehensive CreatiCode simulation that represents a complete system or device (e.g., a smart home with multiple rooms, devices, sensors, and user controls; an autonomous robot with navigation, obstacle detection, and task execution; a data-logging environmental monitor with multiple sensors and visualization).",
    "dependencies": [
      "T30.G7.01"
    ]
  },
  {
    "id": "T31.G7.01",
    "title": "Model a distributed multiplayer game server",
    "short_name": "How game servers work",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 7,
    "description": "Students understand that a multiplayer game uses a central server that receives data from all players and sends updates back. They model the flow: player sends action to server, server broadcasts update to all players.",
    "dependencies": [
      "T31.G6.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T31.G7.02",
    "title": "Design a protocol for multiplayer state sync",
    "short_name": "Create a message format for multiplayer data",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 7,
    "description": "Students design a simple protocol (message format) for multiplayer games, specifying what data gets sent (e.g., player_id, x_position, y_position, action). They recognize that a clear protocol keeps all players in sync.",
    "dependencies": [
      "T31.G6.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T31.G7.03",
    "title": "Evaluate network topology and efficiency",
    "short_name": "Choosing the best network design",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 7,
    "description": "Students compare different network topologies (star, mesh, peer-to-peer) for multiplayer games. They reason about which is most efficient (fewest hops), most resilient, most secure.",
    "dependencies": [
      "T31.G6.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T31.G7.04",
    "title": "Analyze the impact of networked systems on society",
    "short_name": "How the internet changed the world",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 7,
    "description": "Students research and analyze how networked systems (the internet, social media, multiplayer games, cloud storage) have impacted society: positively (connection, information access) and negatively (privacy, addiction, misinformation).",
    "dependencies": [
      "T31.G6.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T31.G8.01",
    "title": "Understand TCP/IP and packet routing",
    "short_name": "How the internet routes data",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 8,
    "description": "Students learn about the TCP/IP protocol: how data is split into packets, assigned IP addresses, and routed across the internet via routers. They trace a message's journey from source to destination.",
    "dependencies": [
      "T31.G7.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T31.G8.02",
    "title": "Design a secure multiplayer system",
    "short_name": "Protect multiplayer games from attacks",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 8,
    "description": "Students recognize that multiplayer games can be attacked or cheated (e.g., someone spoofing another player, hacking the server). They design defenses: authentication, encryption, server-side validation.",
    "dependencies": [
      "T31.G7.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T31.G8.03",
    "title": "Implement data encryption for privacy",
    "short_name": "Encrypt data for protection",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 8,
    "description": "Students understand that sensitive data (passwords, personal info) should be encrypted before sending over the internet. They learn basic encryption ideas: scrambling data so only the intended receiver can read it.",
    "dependencies": [
      "T31.G7.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T31.G8.04",
    "title": "Evaluate resilience and redundancy in networks",
    "short_name": "How the internet stays up",
    "topic_id": "T31",
    "topic_name": "Internet, Cloud & Networked Systems",
    "grade": 8,
    "description": "Students learn that the internet is designed with redundancy: multiple paths for data, backup servers, and distributed architecture so that if one part fails, data can still be routed elsewhere.",
    "dependencies": [
      "T31.G7.01",
      "T19.G5.01"
    ]
  },
  {
    "id": "T32.G7.01",
    "title": "Explain Defense in Depth strategy",
    "short_name": "Layers of security protection",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 7,
    "description": "Students understand that security requires multiple layers: network firewalls, device passwords, multi‑factor auth, encryption, and user education. If one layer fails, others still protect. They can describe each layer and why it matters.",
    "dependencies": [
      "T32.G6.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G7.02",
    "title": "Respond to a cybersecurity incident",
    "short_name": "What to do if you think you've been hacked",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 7,
    "description": "Students learn incident response steps: stop using the account, change passwords, check account activity, contact support, scan for malware. They understand the importance of quick action.",
    "dependencies": [
      "T32.G6.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G7.03",
    "title": "Evaluate how design decisions affect security",
    "short_name": "How design choices impact user experience and security",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 7,
    "description": "Students analyze how interface design, default settings, or feature choices affect security and user behavior. E.g., \"Is it good that sharing is the default? Why?\" They understand trade‑offs between ease‑of‑use and security.",
    "dependencies": [
      "T32.G6.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G7.04",
    "title": "Identify secure vs. insecure practices in code or systems",
    "short_name": "Spot security flaws in programs",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 7,
    "description": "Students review simple code or system descriptions and identify insecure practices (e.g., storing passwords in plain text, not validating user input, hardcoding secrets). They understand why these are risky.",
    "dependencies": [
      "T32.G6.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G8.01",
    "title": "Analyze real-world cybersecurity incident case studies",
    "short_name": "Learn from security breaches and attacks",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 8,
    "description": "Students examine documented cybersecurity incidents (e.g., major data breaches, ransomware attacks) to understand how they happened, what vulnerabilities were exploited, and how they could have been prevented or responded to better.",
    "dependencies": [
      "T32.G7.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G8.02",
    "title": "Make informed decisions about privacy settings and data sharing",
    "short_name": "Evaluate privacy trade-offs",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 8,
    "description": "Students critically examine when and with whom to share data, considering company policies, their own comfort, and potential risks. They weigh benefits (e.g., personalization, convenience) against risks (tracking, data sales, breaches).",
    "dependencies": [
      "T32.G7.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G8.03",
    "title": "Understand encryption at a deeper level",
    "short_name": "How encryption secures data in transit and at rest",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 8,
    "description": "Students understand that encryption protects data both when stored (at rest) and when transmitted (in transit). They distinguish between different encryption contexts (e.g., HTTPS for web, encrypted email, encrypted hard drives) and why each matters.",
    "dependencies": [
      "T32.G7.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G8.04",
    "title": "Evaluate the security of a technology or system",
    "short_name": "Assess security features and risks",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 8,
    "description": "Students comprehensively evaluate a technology (app, website, platform, device) for security features, vulnerabilities, privacy practices, and suitability for a particular use. They provide justified recommendations.",
    "dependencies": [
      "T32.G7.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T32.G8.05",
    "title": "Understand ethical implications of cybersecurity decisions",
    "short_name": "Weigh ethics in security trade-offs",
    "topic_id": "T32",
    "topic_name": "Cybersecurity & Safe Online Behavior",
    "grade": 8,
    "description": "Students reflect on ethical questions: Is monitoring employees ethical? Is encryption that prevents police investigation wrong? Are security requirements that exclude some people fair? They practice nuanced reasoning about conflicting values.",
    "dependencies": [
      "T32.G7.01",
      "T31.G3.01"
    ]
  },
  {
    "id": "T33.G7.01",
    "title": "Compare cloud storage solutions",
    "short_name": "Understand different ways to save data",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 7,
    "description": "Students compare cloud variables in CreatiCode with other ways to save data online (e.g., Google Drive, cloud databases, email). They understand trade-offs: ease of use vs. functionality, security, privacy, and cost. This builds understanding of platform choice and data stewardship.",
    "dependencies": [
      "T33.G6.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T33.G7.02",
    "title": "Trace a multi-service project architecture",
    "short_name": "Understand a project's external dependencies",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 7,
    "description": "Given a more complex CreatiCode project that uses multiple external services (e.g., ChatGPT, speech, multiplayer, cloud variables), students map out and describe which services it relies on, what data flows between them, and what would break if each service failed.",
    "dependencies": [
      "T33.G6.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T33.G7.03",
    "title": "Evaluate algorithmic bias in AI services",
    "short_name": "Recognize bias in AI tools",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 7,
    "description": "Students learn that AI services (like ChatGPT, translation, or image generation) can have biases. For example, ChatGPT might give different answers based on how a question is phrased, or an image generator might produce stereotyped results. Students think about impacts and responsibility.",
    "dependencies": [
      "T33.G6.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T33.G7.04",
    "title": "Design for offline resilience",
    "short_name": "Make a project work without internet",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 7,
    "description": "Students design or modify a CreatiCode project to work as much as possible even when the internet is down or external services fail. For example, storing some data locally, caching API responses, or offering offline alternatives. This builds thinking about robustness.",
    "dependencies": [
      "T33.G6.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T33.G8.01",
    "title": "Analyze the business model of a platform",
    "short_name": "How do platforms make money?",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 8,
    "description": "Students learn that platforms like CreatiCode, YouTube, or ChatGPT have business models: some are free with ads, some charge subscriptions, and some collect and sell user data. Students analyze the trade-offs and ethical implications.",
    "dependencies": [
      "T33.G7.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T33.G8.02",
    "title": "Evaluate environmental impact of cloud services",
    "short_name": "Cloud services and environmental cost",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 8,
    "description": "Students learn that cloud services (where data and computations happen on distant servers) require significant electricity and infrastructure (data centers). They evaluate the environmental cost of using these services and think about sustainability.",
    "dependencies": [
      "T33.G7.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T33.G8.03",
    "title": "Consider digital equity and access",
    "short_name": "Not everyone can access the same platforms",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 8,
    "description": "Students recognize that access to platforms and APIs is not universal—students in low-income areas, rural regions, or developing countries may lack reliable internet. They think about implications: What happens to their project if someone doesn't have internet? How should platform creators think about equity?",
    "dependencies": [
      "T33.G7.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T33.G8.04",
    "title": "Plan a responsible project using external services",
    "short_name": "Design an ethical project with APIs",
    "topic_id": "T33",
    "topic_name": "Platforms, APIs & External Services",
    "grade": 8,
    "description": "Students design a new project concept that uses external services (AI, cloud data, multiplayer) and explicitly plan for privacy, data security, bias, and accessibility. They write or present a brief design document considering these concerns.",
    "dependencies": [
      "T33.G7.01",
      "T31.G4.01",
      "T11.G4.01"
    ]
  },
  {
    "id": "T34.G7.01",
    "title": "Major eras of computing history",
    "short_name": "Computing eras: mainframes to AI",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 7,
    "description": "Students learn and distinguish major eras in computing history: mechanical computing (abacus, Babbage's difference engine), electronic/mainframe era (1940s–1960s), personal computer era (1970s–1980s), internet/web era (1990s–2000s), mobile and cloud era (2010s), and AI era (2020s). They understand how each era introduced different capabilities and challenges.",
    "dependencies": [
      "T34.G6.01"
    ]
  },
  {
    "id": "T34.G7.02",
    "title": "Key figures and their contributions",
    "short_name": "Notable people who shaped computing",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 7,
    "description": "Students research and report on multiple notable computing figures from diverse backgrounds and eras (Charles Babbage, Ada Lovelace, Alan Turing, Grace Hopper, Steve Jobs, Bill Gates, Linus Torvalds, Sheryl Sandberg, etc.). They understand computing progress through the lens of individual and collaborative achievement.",
    "dependencies": [
      "T34.G6.01"
    ]
  },
  {
    "id": "T34.G7.03",
    "title": "Comparing historical computing innovations",
    "short_name": "How different innovations shaped the world",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 7,
    "description": "Students compare two or more historical computing innovations (e.g., transistor vs integrated circuit; TCP/IP vs HTML; graphical user interface vs command line) in terms of their effects on computing capabilities, accessibility, and society. They analyze both similarities and differences in impact.",
    "dependencies": [
      "T34.G6.01"
    ]
  },
  {
    "id": "T34.G7.04",
    "title": "Environmental and social impacts of computing evolution",
    "short_name": "Computing's effects on the environment and society",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 7,
    "description": "Students examine how computing technology expansion has affected the environment (e-waste, energy consumption of data centers, manufacturing pollution) and society (job displacement, digital divides, inequality, benefits of automation). They develop critical perspective on progress and trade-offs.",
    "dependencies": [
      "T34.G6.01"
    ]
  },
  {
    "id": "T34.G8.01",
    "title": "Policies and legislation shaping computing",
    "short_name": "Laws and rules that guide computing",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 8,
    "description": "Students examine policies and legislation that have shaped computing development and use: intellectual property laws, data protection regulations (GDPR, CCPA), accessibility requirements (Section 508), content moderation rules, AI governance proposals, etc. They understand that computing evolves within a regulatory and legal context.",
    "dependencies": [
      "T34.G7.01"
    ]
  },
  {
    "id": "T34.G8.02",
    "title": "Historical disparities in computing access and benefits",
    "short_name": "Who benefits from computing? Who doesn't?",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 8,
    "description": "Students analyze historical patterns showing how computing benefits and access have been distributed unequally across groups (gender disparities in tech careers, digital divides by geography and socioeconomic status, bias in AI training data, underrepresentation of women and people of color in computing). They connect history to present-day inequities.",
    "dependencies": [
      "T34.G7.01"
    ]
  },
  {
    "id": "T34.G8.03",
    "title": "Computing innovations responding to societal needs",
    "short_name": "How innovations solve real-world problems",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 8,
    "description": "Students research and analyze multiple computing innovations developed in response to specific societal needs or crises: medical computing for diagnosis and treatment, financial computing for transactions, educational technology for remote learning, disaster response apps, etc. They see computing as pragmatic problem-solving.",
    "dependencies": [
      "T34.G7.01"
    ]
  },
  {
    "id": "T34.G8.04",
    "title": "Futures thinking: Computing trends and implications",
    "short_name": "Where is computing headed and what matters?",
    "topic_id": "T34",
    "topic_name": "History of Computing & Diverse Pioneers",
    "grade": 8,
    "description": "Students examine current trends in computing (AI, quantum computing, biotechnology integration, internet of things, decentralization) and speculate about future implications for society, environment, work, and daily life. They develop forward-looking critical thinking.",
    "dependencies": [
      "T34.G7.01"
    ]
  },
  {
    "id": "T35.G7.01",
    "title": "Analyze unintended systemic impacts of a technology",
    "short_name": "How does one technology change everything?",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 7,
    "description": "Students examine how a single technology can create ripple effects across society (e.g., smartphones enabling communication but also job displacement in certain sectors, social media enabling connection but also affecting mental health). They map systems and second-order effects.",
    "dependencies": [
      "T35.G6.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T35.G7.02",
    "title": "Evaluate equity and access across communities",
    "short_name": "Do all communities benefit equally from a technology?",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 7,
    "description": "Students research or analyze whether access to and benefits from a technology (e.g., broadband, AI tools, smartphones) are equally distributed, and what happens when some communities lack access.",
    "dependencies": [
      "T35.G6.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T35.G7.03",
    "title": "Examine the environmental life cycle of a technology",
    "short_name": "The full environmental impact of a device",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 7,
    "description": "Students trace the full environmental lifecycle of a computing device: extraction of materials, manufacturing, shipping, use, and disposal/recycling. They quantify or estimate the carbon footprint and waste.",
    "dependencies": [
      "T35.G6.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T35.G7.04",
    "title": "Propose a technology solution with ethical considerations",
    "short_name": "Design a responsible technology solution",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 7,
    "description": "Students propose a new technology (or improve an existing one) to solve a real problem while considering potential negative effects, equity, environmental impact, and privacy. They justify their approach.",
    "dependencies": [
      "T35.G6.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T35.G8.01",
    "title": "Evaluate an emerging technology from multiple perspectives",
    "short_name": "Who benefits and who is harmed by a new technology?",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 8,
    "description": "Students evaluate a specific emerging technology (e.g., facial recognition, autonomous vehicles, AI in hiring) through the lens of different stakeholders (developers, users, workers affected by job loss, marginalized communities, environment) and explain how different groups have conflicting interests.",
    "dependencies": [
      "T35.G7.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T35.G8.02",
    "title": "Analyze policy and regulation of an emerging technology",
    "short_name": "Should governments regulate this technology?",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 8,
    "description": "Students examine how governments and organizations regulate or should regulate emerging technologies (e.g., data privacy laws, AI transparency requirements, content moderation), weighing innovation, safety, freedom, and fairness.",
    "dependencies": [
      "T35.G7.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T35.G8.03",
    "title": "Investigate personal data collection and privacy",
    "short_name": "What data do companies collect about you?",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 8,
    "description": "Students investigate what personal data apps and websites collect about them (location, behavior, preferences), how it is used (targeted ads, training AI), and what privacy risks this creates.",
    "dependencies": [
      "T35.G7.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T35.G8.04",
    "title": "Create a presentation on responsible AI use",
    "short_name": "Communicate about AI impacts and responsibility",
    "topic_id": "T35",
    "topic_name": "Impacts of Computing, Games & AI",
    "grade": 8,
    "description": "Students research an AI application (e.g., chatbots, image recognition, recommendation systems) and create a presentation or essay for peers addressing: what it does, who created it, intended benefits, known harms or biases, ethical concerns, and what responsible use looks like.",
    "dependencies": [
      "T35.G7.01",
      "T21.G5.01"
    ]
  },
  {
    "id": "T36.G7.01",
    "title": "How tech transforms industries and jobs",
    "short_name": "Analyze how technology changes careers and industries",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 7,
    "description": "Students examine a specific industry (agriculture, manufacturing, healthcare, entertainment) and trace how computing and automation have changed the jobs available, the skills needed, and the opportunities for workers. They consider both positive changes (new careers) and challenges (job displacement, need for retraining).",
    "dependencies": [
      "T36.G6.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  },
  {
    "id": "T36.G7.02",
    "title": "Ethical evaluation of emerging technologies",
    "short_name": "Evaluate a new technology for ethics and fairness",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 7,
    "description": "Students select an emerging technology (AI, VR, IoT, blockchain, autonomous vehicles, facial recognition) and conduct a thorough ethical evaluation: What is it designed to do? Who benefits? Who might be harmed? Is it fair? Is it accessible? What policies should govern it?",
    "dependencies": [
      "T36.G6.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  },
  {
    "id": "T36.G7.03",
    "title": "Lead a team project with clear communication",
    "short_name": "Manage a collaborative project from start to finish",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 7,
    "description": "Students take on a leadership role in a multi-person, multi-week CreatiCode project. They practice planning (breaking tasks into steps, assigning roles), communicating clearly (holding meetings, writing updates), managing time and conflicts, and presenting results professionally.",
    "dependencies": [
      "T36.G6.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  },
  {
    "id": "T36.G7.04",
    "title": "Reflect on fairness in your team and project",
    "short_name": "Assess your team's inclusivity and your project's fairness",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 7,
    "description": "Students reflect on two aspects: (1) Did our team work fairly—did everyone contribute, were decisions made inclusively, was credit given? (2) Is our project inclusive and fair—does it include diverse characters, avoid stereotypes, work well for people with different abilities?",
    "dependencies": [
      "T36.G6.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  },
  {
    "id": "T36.G8.01",
    "title": "Analyze societal impacts of computing technologies",
    "short_name": "Examine how a technology impacts society and inequality",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 8,
    "description": "Students conduct a research project analyzing how a widely used technology (social media, smartphones, AI assistants, cloud services, surveillance systems, e-commerce) impacts different groups of people, considering access, equity, environmental effects, cultural impacts, and power dynamics. They present nuanced, evidence-based arguments.",
    "dependencies": [
      "T36.G7.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  },
  {
    "id": "T36.G8.02",
    "title": "Explore a computing career pathway",
    "short_name": "Investigate a specific computing career and its requirements",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 8,
    "description": "Students deep-dive into a computing-related career of interest (game developer, data scientist, cybersecurity specialist, AI researcher, software engineer, digital artist, tech policy analyst, etc.), researching education requirements, skills needed, salary range, daily tasks, and how computing interacts with their values and interests. They assess fit with their own aspirations.",
    "dependencies": [
      "T36.G7.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  },
  {
    "id": "T36.G8.03",
    "title": "Design a solution with ethics at the center",
    "short_name": "Create a project that solves a problem fairly",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 8,
    "description": "Students identify a real problem or need (accessibility barrier, environmental challenge, educational gap, social issue) and design a CreatiCode project or prototype that attempts to solve it while explicitly considering: Who is this for? What biases might we introduce? How do we include diverse perspectives in the design? How will we know if it actually helps?",
    "dependencies": [
      "T36.G7.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  },
  {
    "id": "T36.G8.04",
    "title": "Communicate professionally about your work",
    "short_name": "Present your project professionally to diverse audiences",
    "topic_id": "T36",
    "topic_name": "Ethics, Careers, Collaboration & Communication in CS",
    "grade": 8,
    "description": "Students develop a polished presentation or documentation of a substantial project suitable for multiple audiences (classmates, teachers, parents, competition judges, potential employers). They practice adapting their communication to audience, using technical vocabulary appropriately, and conveying both technical details and broader impact.",
    "dependencies": [
      "T36.G7.01",
      "T21.G5.01",
      "T24.G5.01"
    ]
  }
]
