[
  {
    "id": "T01.G1.01",
    "title": "Write or draw steps for a simple task",
    "short_name": "Create step-by-step instructions for a task",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 1,
    "description": "Students create a sequence of simple, numbered steps to describe how to complete a task (e.g., \"Make a sandwich\" or \"Sharpen a pencil\"). They understand that clear, ordered steps form an algorithm and that the person following the instructions should be able to succeed.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G1.02",
    "title": "Trace and predict the outcome of a simple algorithm",
    "short_name": "Follow steps to see what happens",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 1,
    "description": "Given a short sequence of steps (e.g., \"Start at the door. Walk forward 3 steps. Turn left. Walk forward 2 steps. Stop.\"), students predict or trace where they end up or what object they reach. This develops the practice of mental simulation and reasoning about algorithm behavior.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G1.03",
    "title": "Identify missing or incorrect steps in an algorithm",
    "short_name": "Find the mistake in instructions",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 1,
    "description": "Students read or listen to a short algorithm (e.g., \"To get to the playground: Leave classroom, go to playground entrance, go through gate, walk to swings\" but it's missing \"go down the hallway\"). They identify what step is missing or wrong and suggest what should be added or changed.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G1.04",
    "title": "Compare two algorithms for the same task",
    "short_name": "Compare different ways to do something",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 1,
    "description": "Students compare two different sequences of steps that accomplish the same goal (e.g., two different ways to arrange classroom supplies or two paths through a maze). They notice differences and discuss whether both work, which is simpler, or which is faster. This introduces the idea that algorithms can vary.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G2.01",
    "title": "Write an algorithm with \"if/then\" choice",
    "short_name": "Write steps with a choice (if/then)",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 2,
    "description": "Students create or complete a simple algorithm that includes a branching point (e.g., \"If the door is locked, ask for a key. If it's open, go inside.\"). This introduces conditional logic at the algorithm design level, before formal if/else blocks in code.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G2.02",
    "title": "Write an algorithm with a repeat statement",
    "short_name": "Write steps using \"repeat\" or \"do again\"",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 2,
    "description": "Students create or describe an algorithm using natural language for repetition (e.g., \"Repeat 3 times: hop and clap\" or \"Do these steps until the cup is full: pour water, check level, stop\"). This primes the concept of loops before formal loop blocks in code.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G2.03",
    "title": "Trace an algorithm with branching or repetition",
    "short_name": "Follow steps with choices or repeats",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 2,
    "description": "Given an algorithm that includes an if/then choice or a repeat, students mentally or physically trace through it step by step, predicting the final outcome. This builds the mental model of how algorithms behave when they contain branching or loops.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G2.04",
    "title": "Unplugged maze or robot navigation with instructions",
    "short_name": "Write directions to navigate a maze",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 2,
    "description": "Students create a list of turn-and-move instructions (Forward, Left, Right, Stop) that guide a character or robot through a simple grid or maze to reach a goal. This combines sequencing with spatial reasoning and is a classic unplugged precursor to coordinate-based coding.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G3.01",
    "title": "Create a simple algorithm in code (sequence and events)",
    "short_name": "Write a sequence of blocks in code",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 3,
    "description": "Students create a short program using block-based code (in CreatiCode) where a sprite follows a sequence of steps triggered by the green flag. Example: \"When green flag clicked, move 10 steps, turn 90 degrees, move 10 steps, say 'Done!'\" This is the first coded algorithm, focusing on sequence and events.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G3.02",
    "title": "Add a simple if/then (conditional) to an algorithm",
    "short_name": "Add a choice to your algorithm",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 3,
    "description": "Students modify a given script to include an if/then condition (e.g., \"If touching the goal, say 'Victory!'\"). This embeds the conditional logic into code and shows how algorithms can respond differently based on conditions.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G3.03",
    "title": "Use a loop in code for repetition",
    "short_name": "Use a repeat block in code",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 3,
    "description": "Students create a program that uses a repeat (or forever) block to execute a sequence multiple times. Example: Repeat 4 { turn 90 degrees } to spin in a square. This brings the conceptual idea of repetition into actual code.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G3.04",
    "title": "Describe an algorithm in words after running code",
    "short_name": "Explain what a program does",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 3,
    "description": "After creating or being shown a program, students write or speak a description of what the algorithm does. Example: Given a script with sequence and a loop, they write \"The sprite moves forward, then spins around 3 times.\" This reinforces understanding of algorithm behavior through language.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G4.01",
    "title": "Create an algorithm to solve a simple problem",
    "short_name": "Design a program to solve a problem",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 4,
    "description": "Given a problem statement (e.g., \"Make a sprite navigate to the goal without touching walls\"), students design an algorithm from scratch (or refine a starter project) to solve it. This shifts focus from \"following instructions\" to \"designing instructions to achieve a goal.\"",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G4.02",
    "title": "Optimize an algorithm (fewer steps or faster)",
    "short_name": "Improve an algorithm to use fewer steps",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 4,
    "description": "Students compare two algorithms that solve the same problem but one is more efficient (uses fewer blocks, repeats, or conditions). They refactor code to reduce redundancy. Example: replacing five `move 10` blocks with `repeat 5 { move 10 }` or removing an unnecessary check.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G4.03",
    "title": "Use a variable (counter) in an algorithm",
    "short_name": "Use a variable to track something",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 4,
    "description": "Students create a variable (e.g., `score`, `steps`, `lives`) and use it in their algorithm to track state. Example: increment a score when touching a coin, or decrement lives on collision. This introduces variables as part of algorithm design.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G4.04",
    "title": "Trace and predict the behavior of a multi-step algorithm",
    "short_name": "Predict what a complex program does",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 4,
    "description": "Given an algorithm with sequence, branching, loops, and/or a variable, students trace through it step-by-step and predict the final outcome (e.g., final position, final variable value, sequence of events). This builds mental models of complex behavior.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G5.01",
    "title": "Design an algorithm from a flowchart or pseudocode",
    "short_name": "Convert a plan to code",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 5,
    "description": "Given a flowchart or pseudocode description of an algorithm, students translate it into block-based code in CreatiCode. Example: A flowchart shows \"Start → Ask for a number → If number > 10, say 'Big.' Else, say 'Small.' → End.\" Students implement this with if/else blocks and input.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G5.02",
    "title": "Create a flowchart or pseudocode for an algorithm in code",
    "short_name": "Draw or describe an algorithm plan",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 5,
    "description": "Given a program (or a problem), students create a visual flowchart or write pseudocode to represent what it does or what it should do. This is the inverse of G5.01 and reinforces algorithm understanding through representation.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G5.03",
    "title": "Compare two algorithms for the same problem",
    "short_name": "Compare different solutions",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 5,
    "description": "Given two algorithms that solve the same problem (e.g., finding the maximum number in a list), students compare them on criteria like correctness, efficiency (number of steps or iterations), readability, or use of variables. They articulate which is better and why.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G5.04",
    "title": "Debug an algorithm that doesn't work correctly",
    "short_name": "Fix a broken algorithm",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 5,
    "description": "Students are given an algorithm with a logical error (e.g., a loop that runs too many times, a condition with wrong comparison, or missing steps) and must identify and fix the error. This develops reasoning about algorithm correctness.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G6.01",
    "title": "Analyze an algorithm's efficiency in different scenarios",
    "short_name": "Compare algorithm speed for different inputs",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 6,
    "description": "Students examine an algorithm's performance (number of steps) under different input sizes or conditions. Example: A linear search algorithm is faster on a small list than a binary search is on a small list, but they scale differently. Students compare counts of operations or run time.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G6.02",
    "title": "Identify bias or unintended consequences in an algorithm",
    "short_name": "Spot fairness problems in an algorithm",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 6,
    "description": "Students examine a simple algorithm (often a decision algorithm, like \"grading scale\" or \"student selection criteria\") and discuss how it might unfairly impact certain groups. Example: An algorithm that selects only tall students for a team might inadvertently exclude shorter students who are equally qualified. Students articulate the bias and suggest improvements.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G6.03",
    "title": "Create a flowchart for a multi-step problem",
    "short_name": "Draw a flowchart for a complex task",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 6,
    "description": "Students create a detailed flowchart that represents a more complex algorithm with multiple decision points and loops. Example: A flowchart for a simple game turn (ask for input, validate, update score, check if won, repeat if not). This strengthens structured thinking about algorithms.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G6.04",
    "title": "Implement an algorithm in code from a complex flowchart",
    "short_name": "Code from a detailed flowchart",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 6,
    "description": "Students receive a detailed flowchart with multiple branches and loops, then implement it in block-based or introductory text code. This is a direct application of algorithm planning to code.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G7.01",
    "title": "Recognize and apply common algorithm patterns (search, sort, accumulate)",
    "short_name": "Identify algorithm patterns",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Students learn to recognize and name common algorithmic patterns: linear search (find first matching item), simple sort (reorder items), accumulation (collect sums or counts), and simulation (repeat action with updates). When given a problem, they choose the appropriate pattern.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G7.02",
    "title": "Understand why different algorithms are chosen for different problems",
    "short_name": "Choose the right algorithm for the task",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Given a problem, students consider multiple possible algorithms and justify which is most appropriate based on efficiency, clarity, or fit. Example: Why use a specific sorting algorithm over repeated swaps? Why use binary search instead of linear? This develops algorithmic decision-making.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G7.03",
    "title": "Represent an algorithm in pseudocode or text code",
    "short_name": "Write pseudocode for an algorithm",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Students transition from block-based code to pseudocode or simple text-based code representation. They write an algorithm in plain language with code-like structure (e.g., \"for each item in list: if item > max, set max = item\"). This bridges to more formal programming.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G7.04",
    "title": "Analyze an algorithm for correctness on edge cases",
    "short_name": "Test an algorithm on tricky inputs",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 7,
    "description": "Students test an algorithm (given in code or pseudocode) on edge cases (empty input, single item, maximum/minimum values, repeats) and identify if it fails and why. This develops rigorous thinking about algorithm robustness.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G8.01",
    "title": "Design an algorithm for a simulation or model",
    "short_name": "Create an algorithm to simulate a process",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Students design an algorithm that simulates a real-world process or system (e.g., a predator-prey ecosystem, weather patterns with simple rules, or traffic flow). The algorithm repeatedly updates state and checks conditions to model behavior over time. This applies algorithmic thinking to simulation.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G8.02",
    "title": "Understand recursion conceptually (algorithm calling itself)",
    "short_name": "Recognize recursive structure in problems",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Students encounter the concept that some problems can be solved by breaking them into smaller versions of themselves (recursion conceptually, not yet in code). Example: \"To find the largest number in a list, find the larger of the first number and the max of the rest.\" They understand the base case and recursive case but don't yet implement it in code (that's a high school topic).",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G8.03",
    "title": "Analyze the impact of an algorithm on society or individuals",
    "short_name": "Evaluate real-world algorithm impacts",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Students examine a real-world algorithmic system (e.g., social media recommendation, search rankings, college admission scoring) and analyze its societal impacts. They consider who benefits, who might be harmed, ethical implications, and possible improvements.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T01.G8.04",
    "title": "Refactor a complex algorithm for clarity or efficiency",
    "short_name": "Simplify or optimize complex code",
    "topic_id": "T01",
    "topic_name": "Everyday Algorithms & Step‑by‑Step Thinking",
    "grade": 8,
    "description": "Given a working but convoluted or inefficient algorithm (in block or text code), students refactor it to be clearer, more modular, or more efficient. Example: breaking a long script into named procedures, extracting repeated logic into a loop, or optimizing a search to avoid redundant checks.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G1.01",
    "title": "Create an algorithm in pictures and words",
    "short_name": "Make a step-by-step picture guide",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 1,
    "description": "Students are given a simple task (e.g., \"How to build a tower\" or \"How to draw a star\") and create a 3–4 step picture guide showing the sequence. They may label steps with words or just arrange pictures, translating an intuitive understanding of process into a simple visual algorithm.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G1.02",
    "title": "Trace a picture algorithm and predict the outcome",
    "short_name": "Follow picture steps and say what happens",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 1,
    "description": "Students follow a visual, picture‑based algorithm (e.g., a 4‑step recipe in images) and predict or describe the outcome. This is \"tracing\" in a visual, intuitive form: executing the algorithm mentally to see where it leads.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G1.03",
    "title": "Spot when a step is missing or wrong",
    "short_name": "Find the broken algorithm in pictures",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 1,
    "description": "Given a visual algorithm with a missing or illogical step (e.g., a recipe that skips a key ingredient, or a getting-dressed sequence that is out of order), students identify and describe the problem. This begins algorithmic thinking around correctness.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G2.01",
    "title": "Represent a simple algorithm with blocks or boxes",
    "short_name": "Draw a step-by-step box diagram",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 2,
    "description": "Students create a very simple \"algorithm diagram\" using boxes or placeholder blocks to represent steps (not yet flowchart symbols, but just ordered boxes with action labels). This bridges picture algorithms and more formal representations.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G2.02",
    "title": "Trace a simple block script and predict output",
    "short_name": "Follow a block program step by step",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 2,
    "description": "Given a short CreatiCode script with 3–6 blocks (no conditionals yet, just sequence), students mentally execute it or step through it, predicting the final state (e.g., where the sprite ends up, what is drawn, what is said). This is formal tracing of a program.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G2.03",
    "title": "Match a visual algorithm to a script",
    "short_name": "Pair a flowchart/boxes with code blocks",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 2,
    "description": "Students are shown a simple visual algorithm (boxes, arrows, or very basic flowchart) and match it to one of several short scripts that implement it. This reinforces that the same algorithm can be represented in multiple ways.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G2.04",
    "title": "Spot and fix a sequencing error in code",
    "short_name": "Fix blocks that are in wrong order",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 2,
    "description": "Students are given a short script where blocks are out of sequence (e.g., \"say hello\" comes after \"wait 2 seconds\" instead of before) and must reorder them to match an intended outcome or picture guide.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G3.01",
    "title": "Create a simple flowchart with start, end, and action boxes",
    "short_name": "Draw a flowchart for a task",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 3,
    "description": "Students create a flowchart using basic symbols (start oval, action rectangle, end oval) to represent a simple algorithm (e.g., \"How to make a sandwich\" or \"How to greet a friend\"). This is the first formal graphical representation of algorithms.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G3.02",
    "title": "Trace a program with an if/else condition",
    "short_name": "Trace code with a condition",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 3,
    "description": "Given a script with one simple `if` or `if/else` block (e.g., \"if key pressed, move right, else move left\"), students trace through it by following the condition and predicting which branch executes and what the outcome is.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G3.03",
    "title": "Match a flowchart to code with a decision",
    "short_name": "Pair flowchart with if/else code",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 3,
    "description": "Students match a flowchart with a diamond decision symbol to a script that uses an `if/else` block. This reinforces that flowcharts and code represent the same algorithmic logic.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G3.04",
    "title": "Trace a loop and count iterations",
    "short_name": "Count loop repeats in code",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 3,
    "description": "Given a simple script with a `repeat` loop (e.g., `repeat 3 { move 10 }`), students trace it to determine how many times the action inside happens and/or what the total effect is (e.g., \"the sprite moves 30 steps total\").",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G4.01",
    "title": "Create a flowchart with loops",
    "short_name": "Draw a flowchart with a loop symbol",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 4,
    "description": "Students create a flowchart that includes a loop or iteration, using the appropriate flowchart symbol (a back arrow or loop rectangle) to represent \"do this again.\" This introduces algorithmic thinking about repetition as a formal construct.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G4.02",
    "title": "Trace nested conditions and predict outcomes",
    "short_name": "Trace code with multiple if/else blocks",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 4,
    "description": "Students trace a script with two or more sequential `if/else` blocks (not yet nested in the code sense, but multiple conditional decisions in sequence) and follow the logic to predict the final state.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G4.03",
    "title": "Convert a story or real-world process into pseudocode",
    "short_name": "Write pseudocode from a description",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 4,
    "description": "Given a natural-language description of a process (e.g., \"make a peanut butter sandwich\") or a picture algorithm, students write simple pseudocode (everyday language steps, not Python, but more formal than pictures) such as:",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G4.04",
    "title": "Trace a script with a loop and condition together",
    "short_name": "Trace code with loop and condition",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 4,
    "description": "Students trace a script that combines a loop with a conditional inside (e.g., `repeat 5 { if touching edge, bounce else move }`), following the logic through multiple iterations and branching.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G5.01",
    "title": "Create a detailed flowchart with multiple branches",
    "short_name": "Draw a complex flowchart with several decision points",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 5,
    "description": "Students design a flowchart with multiple decision diamonds, multiple paths, and loops, representing a more realistic algorithm (e.g., a decision tree for choosing an activity based on time and weather, or steps to find an item in a list).",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G5.02",
    "title": "Trace an algorithm with variables and counters",
    "short_name": "Trace code with variable updates",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 5,
    "description": "Students trace a script that declares and updates a variable (e.g., a counter or accumulator) through multiple steps or loop iterations, tracking how its value changes and predicting the final value.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G5.03",
    "title": "Write pseudocode for a multi-step algorithm",
    "short_name": "Write pseudocode with loops and conditions",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 5,
    "description": "Students write structured pseudocode (not code, but formal step-by-step language) for an algorithm that includes sequence, loops, and conditionals. Example:",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G5.04",
    "title": "Compare two algorithms and reason about efficiency",
    "short_name": "Compare two algorithms for the same task",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 5,
    "description": "Students are given two different algorithms (flowcharts, pseudocode, or code) that solve the same problem and are asked to compare them in terms of steps, clarity, or efficiency. They articulate reasoning (e.g., \"Algorithm A uses a loop, so it's shorter\" or \"Algorithm B is clearer because...\").",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G6.01",
    "title": "Create a flowchart for a guessing game",
    "short_name": "Design a flowchart for a game algorithm",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 6,
    "description": "Students create a complete flowchart for a simple guessing or decision-making game (e.g., \"Higher or Lower\" or \"Rock-Paper-Scissors\") with multiple branches, loops, and decision points, demonstrating understanding of complex algorithmic structure.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G6.02",
    "title": "Trace code with nested loops and variables",
    "short_name": "Trace nested loops with variable changes",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 6,
    "description": "Students trace a script with nested loops and variable updates (e.g., a nested loop that fills a 2D grid, or loop within loop with a counter), predicting final variable values and patterns produced.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G6.03",
    "title": "Write pseudocode with nested structures",
    "short_name": "Write pseudocode with nested loops and conditions",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 6,
    "description": "Students write pseudocode for algorithms with nested loops or loops containing complex conditionals (e.g., a loop that counts items matching a criteria, or nested loops for a grid). Example:",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G6.04",
    "title": "Compare algorithm representations (flowchart vs. pseudocode vs. code)",
    "short_name": "Convert between flowchart, pseudocode, and code",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 6,
    "description": "Students translate a simple algorithm from one representation to another (e.g., from a flowchart to pseudocode, or from pseudocode to code), recognizing that all represent the same logic.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G7.01",
    "title": "Trace an algorithm with state changes over time",
    "short_name": "Trace a simulation algorithm step by step",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students trace an algorithm that simulates a process or system over multiple timesteps (e.g., a ball rolling, a population growing, or a search process narrowing), tracking state changes and predicting behavior at future steps.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G7.02",
    "title": "Design a flowchart for a sorting or search algorithm",
    "short_name": "Create a flowchart for finding or organizing data",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students create a flowchart for a simple algorithmic task such as linear search, bubble sort, or selection sort, using appropriate decision points and loops to represent the logic.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G7.03",
    "title": "Analyze algorithm complexity and steps required",
    "short_name": "Count steps in algorithms and compare efficiency",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students analyze two algorithms that solve the same problem and count or estimate the number of steps (or time complexity in intuitive terms) each requires for different input sizes, reasoning about which is more efficient.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G7.04",
    "title": "Trace an algorithm and identify a bug or edge case",
    "short_name": "Find where an algorithm fails",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 7,
    "description": "Students trace an algorithm (in pseudocode or code) with specific inputs, identify a case where it produces an incorrect result, and explain why (e.g., \"When the list is empty, it crashes\" or \"When the target is at the end, it takes too long\").",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G8.01",
    "title": "Write and test pseudocode for a non-trivial algorithm",
    "short_name": "Design and verify an algorithm with pseudocode",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students design pseudocode for a more complex algorithm (e.g., finding a median, checking if a number is prime, or simulating a simple game turn), then trace it with multiple test cases to verify correctness.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G8.02",
    "title": "Create a flowchart for a decision-making process",
    "short_name": "Design a flowchart for a real-world decision",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students create a flowchart that models a real-world decision process (e.g., \"Should I play outside?\" with branches based on weather, temperature, and homework done, or \"How to choose a book\" based on genre and length preferences). This shows algorithm thinking applied to everyday reasoning.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G8.03",
    "title": "Analyze and improve an algorithm's representation",
    "short_name": "Optimize how an algorithm is represented",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students are given an algorithm in one form (e.g., a verbose pseudocode) and are asked to improve its clarity or efficiency by refactoring its representation (e.g., shortening pseudocode, simplifying a flowchart, or adding comments to code).",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T02.G8.04",
    "title": "Compare deterministic and probabilistic algorithms",
    "short_name": "Trace algorithms with and without randomness",
    "topic_id": "T02",
    "topic_name": "Representing & Tracing Algorithms",
    "grade": 8,
    "description": "Students trace two versions of an algorithm—one deterministic (same input always produces same output) and one probabilistic (uses randomness)—and articulate the differences, advantages, and disadvantages of each approach.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G1.01",
    "title": "Explain what one part of a system does",
    "short_name": "Describe the function of a part",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 1,
    "description": "Students explain the role of a single part within a system (e.g., \"The wheels help the car roll\" or \"The door lets you enter\"). This builds understanding that parts have specific purposes.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G1.02",
    "title": "Break a simple task into steps (unplugged)",
    "short_name": "List steps to build or make something",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 1,
    "description": "Students describe the steps needed to complete a concrete task (e.g., build a simple tower with blocks, make a sandwich, get ready for PE). They learn that planning requires dividing work into smaller, manageable actions.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G1.03",
    "title": "Match tasks to CreatiCode scenes",
    "short_name": "Plan what happens in each scene",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 1,
    "description": "Given a simple story or game idea (e.g., \"Cat wakes up, eats, plays\"), students identify what scenes would be needed and what happens in each one. This bridges from unplugged planning to CreatiCode structure.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G2.01",
    "title": "Replace repeated blocks with a loop (introductory)",
    "short_name": "Reduce code duplication with repeat",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 2,
    "description": "Students identify repeated code sequences in a simple script and refactor using a loop block, learning that decomposition can mean factoring out repetition. (This skill overlaps with T07 but focuses on the decomposition principle rather than loop mastery.)",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G2.02",
    "title": "Plan a two‑scene story",
    "short_name": "Outline a story with two scenes",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 2,
    "description": "Students plan a simple two‑scene story (e.g., \"Outside\" then \"Inside,\" or \"Before\" and \"After\"), identifying what sprites, costumes, and dialogue appear in each. This introduces planning as a design step before coding.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G2.03",
    "title": "Break a game idea into features",
    "short_name": "List features for a simple game",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 2,
    "description": "Students take a simple game concept (e.g., \"A game where a cat catches falling balls\") and list the main features (e.g., \"Player can move,\" \"Balls fall,\" \"Score goes up\"). This teaches thinking about what needs to be built separately.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G3.01",
    "title": "Decompose a project into scenes and features",
    "short_name": "Plan scenes and features for a project",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 3,
    "description": "Students take a medium‑sized project idea (game, story, or interactive app) and break it into major scenes (e.g., title, level 1, level 2, game over) and features for each (e.g., player movement, enemies, scoring). They create a simple outline or checklist.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G3.02",
    "title": "Assign tasks in a team project",
    "short_name": "Divide work among team members",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 3,
    "description": "In a collaborative setting, students divide a project into individual tasks and assign them to team members (e.g., one student codes player movement, another codes enemies). They understand that breaking work into independent parts makes collaboration easier.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G3.03",
    "title": "Create a to‑do checklist for a project",
    "short_name": "Build a task list with checkpoints",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 3,
    "description": "Students create a detailed task list for a coding project (e.g., \"Make sprite move ☐, Add enemies ☐, Keep score ☐, Add sound ☐, Test the game ☐\"). They learn to track progress and organize multi‑step work.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G4.01",
    "title": "Assess whether a design is well‑decomposed",
    "short_name": "Judge if a plan breaks work into good parts",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 4,
    "description": "Students read a project plan or code structure and evaluate whether it logically breaks a problem into manageable pieces (e.g., \"Does this plan separate player controls from enemy logic?\" \"Are the scenes clearly defined?\"). They learn design criteria.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G4.02",
    "title": "Refactor code to separate concerns",
    "short_name": "Reorganize code for clarity",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 4,
    "description": "Students rewrite a monolithic script by extracting related blocks into custom blocks or separate sprites (e.g., moving enemy logic from the main script into an \"enemy\" sprite). This reinforces decomposition as a code quality principle.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G4.03",
    "title": "Plan a multi‑level game with visuals",
    "short_name": "Create a visual game plan",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 4,
    "description": "Students plan a multi‑level game (e.g., three levels with increasing difficulty) using flowcharts, sketches, or a written outline that shows how scenes connect and what happens in each. They learn to visualize dependencies.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G4.04",
    "title": "Identify dependencies between tasks",
    "short_name": "Recognize task order and dependencies",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 4,
    "description": "Students read a project plan and identify which tasks must be done before others (e.g., \"We need to design the sprite before we can code its movement\"). They learn that decomposition is not just about breaking work apart, but organizing it in the right order.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G5.01",
    "title": "Analyze a plan for efficiency",
    "short_name": "Judge a plan for wasted effort",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 5,
    "description": "Students read a project plan and identify redundant or inefficient steps (e.g., \"Why code enemy movement twice for two different enemies?\" or \"Do we need a separate level for that?\"). They learn to optimize decomposition.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G5.02",
    "title": "Create a detailed project plan with stages",
    "short_name": "Write a full project plan",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 5,
    "description": "Students create a comprehensive plan for a moderately complex project (game, story, or app), broken into planning, coding, testing, and refinement stages. They list features, sprites, and milestones for each stage.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G5.03",
    "title": "Use XO to brainstorm and refine a project plan",
    "short_name": "Use AI to help plan your project",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 5,
    "description": "Students use CreatiCode's XO AI assistant to brainstorm features, break a project into scenes, or refine their plan (e.g., \"What scenes would a space game need?\"). They learn that AI can support planning while they remain in control of the final design.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G5.04",
    "title": "Refactor repeated logic into custom blocks",
    "short_name": "Use custom blocks to simplify code",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 5,
    "description": "Students take code with repeated patterns or logic (e.g., three enemies with the same movement code) and extract the logic into a custom block (\"move enemy\") that is called multiple times. This shows decomposition at the code level.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G6.01",
    "title": "Trace a complex plan and identify components",
    "short_name": "Understand a multi-part system design",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 6,
    "description": "Students read a detailed project plan or design document for a moderately complex system (e.g., a game with multiple levels, enemy types, UI menus) and identify the main components, how they interact, and which are dependent on others.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G6.02",
    "title": "Refactor a design document to improve clarity",
    "short_name": "Reorganize a plan for better understanding",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 6,
    "description": "Students take a project design document that is unclear or poorly organized and restructure it (e.g., group related features, reorder scenes logically, add headings) to make it clearer. This teaches design documentation as a skill.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G6.03",
    "title": "Use XO to generate a detailed project plan",
    "short_name": "Ask XO to help plan a complex project",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 6,
    "description": "Students use XO to generate a detailed plan for a project beyond simple games (e.g., an educational app, a story with branching paths, a data visualization). They refine XO's suggestions and create a final plan that reflects their own choices.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G6.04",
    "title": "Analyze algorithms for decomposable parts",
    "short_name": "Find reusable patterns in algorithms",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 6,
    "description": "Students analyze a more complex algorithm (e.g., sorting, searching, or a game loop) and identify repeated or reusable logic that could be extracted into helper functions or custom blocks.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G7.01",
    "title": "Design a multi-stage simulation plan",
    "short_name": "Plan a step-by-step simulation",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students design a detailed plan for a simulation (e.g., ecosystem, physics, or social dynamics) that breaks it into components (agents, rules, interactions, data collection) and stages (setup, run, analyze). They learn systems thinking.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G7.02",
    "title": "Use XO to brainstorm and structure a game design document",
    "short_name": "Create a GDD with XO help",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students use XO to brainstorm and structure a formal Game Design Document (GDD) for a moderately complex game (mechanics, level progression, art style, story beats). They learn a professional planning format while leveraging AI.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G7.03",
    "title": "Decompose a data-driven app into models and views",
    "short_name": "Separate data and UI in a plan",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students plan an interactive data app (e.g., a leaderboard dashboard, quiz show, or survey tool) and explicitly separate the data model (what data is stored) from the UI (how it's displayed and interacted with). This teaches architectural decomposition.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G7.04",
    "title": "Identify and fix poor decomposition in a plan",
    "short_name": "Find and improve bad design choices",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 7,
    "description": "Students review a project plan that has poor decomposition (e.g., all code in one sprite, no separation between logic and UI, unclear dependencies) and suggest improvements to make it more modular and maintainable.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G8.01",
    "title": "Plan a multi-feature interactive app with XO",
    "short_name": "Design a complex app with AI guidance",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students use XO to help plan a large project with multiple interconnected features (e.g., a learning app with lessons, quizzes, progress tracking, and a leaderboard). They create a detailed architecture plan showing data flow, feature modules, and dependencies.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G8.02",
    "title": "Create a formal project specification document",
    "short_name": "Write a professional project spec",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students create a formal specification document for a non-trivial project, including requirements, system architecture, component descriptions, data schemas, and testing strategy. This mimics industry-standard documentation.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G8.03",
    "title": "Analyze project complexity and estimate effort",
    "short_name": "Judge project scope and effort",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students read project plans of varying ambition and estimate the relative effort and risk (e.g., \"This plan requires 5 different sprites and complex collision—it's a 6-week project.\" vs \"This is simpler, maybe 2 weeks.\"). They learn to realistically assess scope.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T03.G8.04",
    "title": "Refactor a large codebase into modules",
    "short_name": "Reorganize complex code into parts",
    "topic_id": "T03",
    "topic_name": "Problem Decomposition & Project Planning",
    "grade": 8,
    "description": "Students take a moderately complex, working program (e.g., a game with 200+ blocks) and refactor it by extracting repeated logic into custom blocks, separating concerns across sprites, and adding documentation. This is a real-world refactoring task.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G1.01",
    "title": "Find repeated blocks in a script",
    "short_name": "Spot repeated blocks in code",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 1,
    "description": "Students identify sequences of identical or very similar blocks that repeat within a short script (e.g., four `move 10 steps` blocks in a row). This builds awareness of redundant code and prepares the ground for later replacing it with loops or custom blocks.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G1.02",
    "title": "Match a repeated picture story to code",
    "short_name": "Match repeated actions to code",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 1,
    "description": "Students match a short picture story showing repeated actions (e.g., jump, jump, jump) to one of several simple scripts that replicate the same repeated action (e.g., three `jump` blocks). This strengthens mapping between informal descriptions and repeated code.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G1.03",
    "title": "Recognize a template structure in sprite code",
    "short_name": "Spot a repeating template in code",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 1,
    "description": "Students examine a provided starter script (template) where a single sprite sequence repeats (e.g., \"step, pause, step, pause\" happening twice), and they describe or identify the core repeated unit, building readiness to use and modify templates.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G1.04",
    "title": "Build a simple repeating script (no loops)",
    "short_name": "Repeat an action by copying blocks",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 1,
    "description": "Students build a short script where a sprite repeats a simple action a given number of times (e.g., clap 3 times) by duplicating blocks, but without using loop blocks. This solidifies repetition as repeating code and the idea of copy‑and‑paste solutions.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G2.01",
    "title": "Identify repeating sections in longer scripts",
    "short_name": "Find repeated sequences in code",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 2,
    "description": "Students examine longer scripts (10‑15 blocks) and identify sections that repeat, even if scattered or with small variations. They learn to spot inefficiency and understand the value of consolidation.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G2.02",
    "title": "Replace repeated code with a loop",
    "short_name": "Use a repeat loop instead of copy‑paste",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 2,
    "description": "Students refactor a script that contains repeated blocks (e.g., five `move 10 steps`) into an equivalent script that uses a `repeat` loop, understanding that loops reduce duplication and make code easier to change.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G2.03",
    "title": "Use a template project and customize it",
    "short_name": "Start from a template and modify it",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 2,
    "description": "Students are given a template CreatiCode project (e.g., a simple animation or interactive scene) and make small targeted changes (e.g., change colors, add a sprite, adjust timing). They learn that templates are starting points and can be reused with customization.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G2.04",
    "title": "Predict what a simple repeated pattern produces",
    "short_name": "Trace repeated actions and predict the result",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 2,
    "description": "Students read or trace a script with repeated blocks (e.g., four `move 10 steps`) and predict the final outcome qualitatively (e.g., \"far to the right\") or quantitatively (e.g., \"40 steps total\"), connecting repetition to cumulative effect.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G3.01",
    "title": "Decompose a pattern into repeating units",
    "short_name": "Break a pattern into smaller pieces",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 3,
    "description": "Students analyze a visual or behavioral pattern (e.g., a row of stamps repeated multiple times to form a grid) and identify both the core unit that repeats and how many times it repeats, practicing decomposition.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G3.02",
    "title": "Create a nested loop pattern",
    "short_name": "Use nested loops for patterns",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 3,
    "description": "Students use a loop inside a loop to make patterns such as a row of stamps repeated multiple times (e.g., a 3×4 grid). They learn that nested loops multiply repetitions and allow compact expression of complex patterns.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G3.03",
    "title": "Recognize a reusable behavior and create a custom block",
    "short_name": "Build a custom block for a repeated action",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 3,
    "description": "Students identify a repeating behavior in a script (e.g., \"turn 90 degrees and move 20 steps\" happening multiple times) and create a custom block (procedure) to encapsulate it, learning that custom blocks reduce duplication and improve readability.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G3.04",
    "title": "Trace a nested pattern and count outcomes",
    "short_name": "Predict outcomes of nested patterns",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 3,
    "description": "Students read a script with nested loops (e.g., `repeat 3 { repeat 2 { stamp } }`) and predict how many times an action occurs or how many items appear, reinforcing multiplicative reasoning with patterns.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G4.01",
    "title": "Analyze repeated code for abstraction opportunities",
    "short_name": "Find code to turn into a procedure",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 4,
    "description": "Students examine a longer script with several repeated multi‑block sequences (possibly with small parameter variations, like different move amounts) and identify which parts are reusable, considering how to parameterize them if needed.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G4.02",
    "title": "Convert repeated blocks into a parameterized custom block",
    "short_name": "Create a custom block with parameters",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 4,
    "description": "Students refactor repeated code into a single custom block with parameters (e.g., `draw_polygon(sides, size)`). They learn that parameters allow one block to handle multiple similar tasks, achieving even greater code reuse than loops alone.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G4.03",
    "title": "Refactor repeated code to use loops and custom blocks",
    "short_name": "Clean up code by combining loops and custom blocks",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 4,
    "description": "Students are given a script with both redundant copy‑paste code and opportunities to nest or parameterize. They refactor to use both loops (for iteration within a pattern) and custom blocks (for abstraction), learning when to apply each technique.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G4.04",
    "title": "Assess effectiveness of a pattern recognition strategy",
    "short_name": "Evaluate how well a pattern is abstracted",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 4,
    "description": "Students compare two solutions to the same problem: one using repeated code and one using loops/custom blocks. They discuss or analyze which is more maintainable, clearer, and easier to modify, developing critical thinking about code quality.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G5.01",
    "title": "Identify patterns in data and represent them with variables",
    "short_name": "Spot patterns in data with variables",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 5,
    "description": "Students examine a sequence of data values (e.g., scores increasing by 5 each round, or alternating values) and recognize the underlying pattern, then use variables and loops to generate or process similar data efficiently.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G5.02",
    "title": "Create a reusable library of custom blocks",
    "short_name": "Build and use a custom block library",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 5,
    "description": "Students create several related custom blocks (e.g., `draw_polygon(sides, size)`, `draw_triangle`, `draw_square`) and recognize that this library of blocks encodes common patterns and can be applied in multiple projects, introducing the idea of code libraries and modularity.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G5.03",
    "title": "Generalize a pattern into an algorithm",
    "short_name": "Turn a pattern into a reusable algorithm",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 5,
    "description": "Students take a specific repeating pattern (e.g., \"draw a checkerboard\") and generalize it into a parameterized algorithm (nested loops with dynamic sizing), so that changing one parameter produces the entire family of similar patterns.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G5.04",
    "title": "Refactor a complex pattern into smaller, composable blocks",
    "short_name": "Decompose a big pattern into smaller reusable parts",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 5,
    "description": "Students take a complex visual pattern or animation (e.g., a fancy border made of repeated sections) and break it into smaller custom blocks that can be reused independently, understanding that patterns themselves can be built from simpler patterns.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G6.01",
    "title": "Recognize structural patterns in algorithms",
    "short_name": "Spot common algorithm patterns",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 6,
    "description": "Students analyze code and identify common structural patterns (e.g., counter increments, accumulator updates, conditional nesting) that appear across different programs, learning that algorithms often follow recognizable templates.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G6.02",
    "title": "Refactor repeated code into modular custom blocks",
    "short_name": "Turn repeated code into reusable procedures",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 6,
    "description": "Students are given longer projects with clearly repeated segments and asked to refactor them into well‑named custom blocks with appropriate parameters, improving code clarity and maintainability.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G6.03",
    "title": "Analyze template projects and customize them systematically",
    "short_name": "Modify template projects for custom needs",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 6,
    "description": "Students examine a template project, understand its structure and key decision points, then make systematic modifications to adapt it for a different purpose (e.g., change a quiz template to use different questions, or adapt a game template with new rules), learning strategic reuse.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G6.04",
    "title": "Compare efficiency of different pattern solutions",
    "short_name": "Evaluate which pattern approach is best",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 6,
    "description": "Students compare two solutions using different pattern techniques (e.g., nested loops vs list iteration, or custom blocks vs inline code) and reason about which is more efficient, readable, or maintainable for a given context.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G7.01",
    "title": "Recognize iteration patterns in different contexts",
    "short_name": "Spot loop patterns in simulations and games",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students identify the iteration patterns underlying common game and simulation behaviors (e.g., \"update physics every frame,\" \"process each sprite,\" \"check all collisions\"), understanding that iteration is a fundamental building block.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G7.02",
    "title": "Design composite algorithms using smaller algorithmic patterns",
    "short_name": "Build algorithms from smaller patterns",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students design a solution to a complex problem by recognizing that it can be decomposed into smaller, standard algorithmic patterns (e.g., a search pattern + an accumulator pattern) and combining them.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G7.03",
    "title": "Optimize code by eliminating redundant patterns",
    "short_name": "Simplify code by removing repeated patterns",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students examine an existing project with redundant patterns and systematically refactor it, combining loops, nesting, and custom blocks to minimize duplication and improve clarity.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G7.04",
    "title": "Explain how pattern recognition leads to better algorithm design",
    "short_name": "Justify pattern‑based design choices",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 7,
    "description": "Students articulate how recognizing patterns in a problem (or in existing solutions) leads to better algorithm design, including improved efficiency, readability, and generalizability.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G8.01",
    "title": "Recognize and leverage common algorithmic patterns",
    "short_name": "Use standard algorithm patterns in solutions",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students identify standard algorithmic patterns (e.g., linear search, accumulation, two‑pointer, divide‑and‑conquer) in problem descriptions and apply them effectively to solve problems, understanding that many problems can be solved by pattern matching to known solutions.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G8.02",
    "title": "Design modular, reusable custom blocks for a project",
    "short_name": "Build a library of procedures for a project",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students design and build a suite of well‑named, well‑documented custom blocks (procedures) for a project, recognizing that good abstractions make code easier to reason about, test, and reuse across multiple scenes or game states.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G8.03",
    "title": "Generalize a specific solution into a parameterized template",
    "short_name": "Turn a solution into a template others can reuse",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students take a working solution to a specific problem (e.g., a quiz with five questions) and generalize it into a reusable template with parameters (e.g., `make_quiz(num_questions, question_list)`) that others can adapt for different inputs, learning that good design anticipates reuse.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T04.G8.04",
    "title": "Analyze and justify choices in pattern‑based design",
    "short_name": "Explain trade‑offs in abstraction and reuse",
    "topic_id": "T04",
    "topic_name": "Patterns & Reusable Solutions",
    "grade": 8,
    "description": "Students examine a project and argue about design choices (e.g., \"Should this be a custom block or inline code?\" \"Is this parameter necessary?\"). They weigh factors like code length, clarity, flexibility, and performance in the context of the problem.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G1.01",
    "title": "Ask what someone needs",
    "short_name": "What does someone need?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 1,
    "description": "Students are given a brief story about a person facing a problem (e.g., \"Priya wants to remember her favorite foods\"). They identify or articulate what the person needs (in this case, a way to remember foods). This teaches observation and empathy as the first step in human‑centered design.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G1.02",
    "title": "Improve a tool for someone",
    "short_name": "Make it better for someone else",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 1,
    "description": "Students are shown a simple tool or program (e.g., a sprite that asks yes/no questions, or a drawing tool). They propose a small improvement that would help a specific person use it better (e.g., \"Add bigger buttons for my little sister\"). This connects user needs to design choices.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G1.03",
    "title": "Spot differences in how people do things",
    "short_name": "Do people solve problems differently?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 1,
    "description": "Students observe or hear about two people solving the same problem in different ways (e.g., one person uses a map, another asks for directions). They notice and articulate that people have different approaches and preferences. This introduces the idea of diverse user needs.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G1.04",
    "title": "Design a simple app idea for someone",
    "short_name": "App idea for a friend",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 1,
    "description": "Students propose a very simple app or program idea that would help someone they know (e.g., \"An app to help my friend remember his soccer games\"). They describe what the app would do and whom it would help. This is informal design documentation.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G2.01",
    "title": "Name the problem and the solution",
    "short_name": "What's the problem? What's the solution?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 2,
    "description": "Given a scenario (e.g., \"Marcus wants to organize his stamps\"), students identify the problem (disorganized stamps) and propose a solution approach (a list, a sorting rule). This develops the habit of framing user needs as problems and algorithm/program design as solutions.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G2.02",
    "title": "Trace a program and say who it helps",
    "short_name": "What does this program do for people?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 2,
    "description": "Students read or trace a short CreatiCode program (e.g., a sprite that keeps a count of button presses) and explain what task it accomplishes and who it might help (e.g., \"It counts votes for a class election\"). This connects code to human purpose.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G2.03",
    "title": "Identify what makes something easy or hard to use",
    "short_name": "Why is it easy or hard to use?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 2,
    "description": "Students examine a simple program (in CreatiCode or conceptually) and identify one feature that makes it easy or hard to use (e.g., \"Big buttons are easy to click,\" \"Too many options are confusing\"). They articulate a reason.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G2.04",
    "title": "Pitch an improvement to a program",
    "short_name": "Suggest one way to improve it",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 2,
    "description": "Students suggest a small, concrete change to an existing simple program (in words or pictures) that would make it more helpful or easier to use (e.g., \"Add a 'quit' button,\" \"Make the text bigger\"). This is early refactoring with user feedback in mind.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G3.01",
    "title": "Plan a program with a user in mind",
    "short_name": "Design for someone specific",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 3,
    "description": "Students brainstorm and plan a simple program (e.g., a quiz game, a story, a tool) by first identifying who will use it and what they need. They create a simple one-page design document that names the user and describes the program's features to meet that person's needs.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G3.02",
    "title": "Create a simple user story",
    "short_name": "User story for a program",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 3,
    "description": "Students write or act out a very simple user story (e.g., \"Aisha wants to remember her favorite songs, so she will add them to a list\"). This reinforces the problem-solution frame and introduces the idea of documenting user needs.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G3.03",
    "title": "Make a UX flow diagram for a simple app",
    "short_name": "Draw the steps in an app",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 3,
    "description": "Students sketch or arrange cards to show the steps a user takes to accomplish a task in a program (e.g., \"Start → Click New Game → Choose Difficulty → Play → See Score → Restart\"). This is an informal UX flow or storyboard.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G3.04",
    "title": "Test a program and give feedback",
    "short_name": "Use a program and say what works",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 3,
    "description": "Students use a simple CreatiCode program, then describe one thing that works well and one thing that could be better. This introduces the concept of user testing and gathering feedback to improve design.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G4.01",
    "title": "Gather feedback and plan improvements",
    "short_name": "What did testers say? Improve it.",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 4,
    "description": "Students are given feedback from hypothetical or real users (e.g., \"The buttons are too small,\" \"It's too easy\"). They identify the feedback, the problem it points to, and propose a design change to address it.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G4.02",
    "title": "Code a program improvement based on feedback",
    "short_name": "Improve your program",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 4,
    "description": "Students have a simple CreatiCode program and receive one piece of concrete feedback (e.g., \"Add a sound when the player wins\"). They modify the code to address the feedback, practicing the iterative design process in a real codebase.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G4.03",
    "title": "Design for different users (accessibility)",
    "short_name": "Design for someone with different needs",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 4,
    "description": "Given a scenario (e.g., \"Design a game for a classmate who is deaf,\" \"Design an interface for someone with low vision\"), students identify one design change that would make a program accessible or usable for that person (e.g., \"Add text labels to all sounds,\" \"Use a big, easy-to-read font\").",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G4.04",
    "title": "Evaluate a program for different user groups",
    "short_name": "Does it work for everyone?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 4,
    "description": "Students examine a program and consider how different people might use it (e.g., young children, English learners, people with slow internet). They identify potential barriers or improvements for each group. This develops awareness of diverse user needs.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G5.01",
    "title": "Create a simple design document",
    "short_name": "Full design plan for a program",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 5,
    "description": "Students create a one- to two-page design document for a simple program, including (1) who the user is, (2) what problem it solves, (3) key features, (4) how the user will interact with it. This formalizes user-centered design thinking.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G5.02",
    "title": "Develop personas for your program",
    "short_name": "Create user personas",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 5,
    "description": "Students create 2–3 simple personas (fictional users) for a program they're designing, describing each person's goal, background, and needs. Example: \"Maya is 7 years old and wants to learn to draw; she needs big, colorful buttons.\" This deepens empathy and helps design decisions.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G5.03",
    "title": "Create a detailed UX flow or storyboard",
    "short_name": "Detailed user journey in your app",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 5,
    "description": "Students map out a user's path through a program in detail (e.g., \"Start screen → Enter name → Choose level → Play → Win → See score → Return to menu\"). Each step shows interaction points and decisions. This is a more mature version of Grade 3's simple flow.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G5.04",
    "title": "Plan what to model and what to simplify",
    "short_name": "Simplify reality for a simulation",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 5,
    "description": "Students plan a simple simulation (e.g., \"A game where a ball falls and bounces\"). They identify aspects of real life they will model (gravity, bouncing) and aspects they will leave out or simplify (air resistance, friction). This teaches the core skill of simulation design: knowing what to include and what to ignore for a specific purpose.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G6.01",
    "title": "Apply HCD principles to a project",
    "short_name": "Use HCD: empathy, needs, accessibility",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 6,
    "description": "Students apply explicit human-centered design principles (empathy mapping, needs analysis, accessibility checklist) to design or evaluate a program or game. They document how each principle was applied.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G6.02",
    "title": "Conduct user research and interviews",
    "short_name": "Interview users to understand needs",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 6,
    "description": "Students design and conduct 1–2 short user interviews (with classmates or family) to understand needs for a program idea. They document responses and identify patterns or key requirements. This is formalized user research.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G6.03",
    "title": "Iterate on a design based on user feedback",
    "short_name": "Refine design through feedback cycles",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 6,
    "description": "Students present a program or design to users, gather feedback, analyze it, and make targeted improvements. They document the feedback loop (feedback → issue identified → change made → tested). This is iterative design in practice.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G6.04",
    "title": "Plan a simulation and defend design choices",
    "short_name": "Simulation design and justification",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 6,
    "description": "Students design a simple educational simulation (e.g., \"Simulate predator-prey population,\" \"Model a water cycle\"). They document what aspects of reality they model and what they simplify, and justify each choice based on educational purpose or computational feasibility.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G7.01",
    "title": "Accessibility audit and remediation",
    "short_name": "Audit a program for accessibility",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students audit an existing program (CreatiCode project or a web app) against an accessibility checklist (readable text, keyboard navigation, color contrast, alt text for images, clear instructions). They identify gaps and propose or implement fixes.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G7.02",
    "title": "Identify and mitigate potential harms in a design",
    "short_name": "What could go wrong? Prevent harms.",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students brainstorm potential negative impacts or unintended consequences of a program they've designed (e.g., \"My game is addictive and kids might play too long,\" \"My chatbot gives wrong answers\"). They identify one harm and propose a mitigation strategy (e.g., add a play-time limit, add a disclaimer, verify sources).",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G7.03",
    "title": "Gather iterative feedback across multiple rounds",
    "short_name": "Multi-round user testing and refinement",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students conduct 2–3 rounds of user testing on a program they're developing. After each round, they analyze feedback, make changes, and test again. They document how the program evolves and reflect on insights gained.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G7.04",
    "title": "Design a simulation for a real-world question",
    "short_name": "Simulation to answer a research question",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 7,
    "description": "Students design and build a simulation to answer a real-world or classroom question (e.g., \"How does population grow if there's limited food?\" or \"What happens to a virus spreading in a population?\"). They define what to model, run the simulation, and interpret results.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G8.01",
    "title": "Analyze potential biases in an algorithm or design",
    "short_name": "Find and fix biases in your design",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students examine an algorithm or program they've designed and identify potential biases (e.g., does it work equally well for all genders, abilities, or backgrounds?). They propose and implement changes to mitigate bias (e.g., diverse imagery, inclusive language, accessible features).",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G8.02",
    "title": "Design for diverse audiences with conflicting needs",
    "short_name": "Serve multiple user groups with different needs",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students design a program or algorithm that must satisfy two or more distinct user groups with potentially conflicting needs (e.g., \"A math game for 2nd graders AND their parents,\" \"A website for English learners AND native speakers\"). They document trade-offs and design decisions that balance needs.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G8.03",
    "title": "Run a controlled simulation experiment",
    "short_name": "Experiment with a simulation model",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students build a simulation, then systematically vary one parameter at a time (e.g., starting population, food availability) and observe effects on outcomes. They document hypotheses, results, and conclusions. This teaches simulation as a tool for experimentation and evidence-based reasoning.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  },
  {
    "id": "T05.G8.04",
    "title": "Evaluate realism and limitations in a simulation",
    "short_name": "How realistic is your simulation?",
    "topic_id": "T05",
    "topic_name": "Human‑Centered Design & Simulation Planning",
    "grade": 8,
    "description": "Students critically examine a simulation they've built or studied and evaluate its realism and limitations. They identify simplifications, assumptions, and edge cases not covered. They articulate how limitations might affect conclusions drawn from the simulation.",
    "csta_code": "",
    "domain": null,
    "domain_id": "Unknown",
    "domain_name": "Unknown"
  }
]